MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
<device>
  <name>MSP430FR5739</name>
  <version>1.1</version>
  <description>MSP430FR5739</description>
  <cpu>
    <name>msp430</name>
  </cpu>
  <peripherals>
    <peripheral>
      <name>ADC10_B</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>ADC10_B</description>
      <registers>
        <register>
          <name>ADC10CTL0</name>
          <addressOffset>0x0700</addressOffset>
          <size>16</size>
          <description>ADC10 Control 0</description>
          <fields>
            <field>
              <name>ADC10SC</name>
              <description>[0:0] ADC10 Start Conversion</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>ADC10ENC</name>
              <description>[1:1] ADC10 Enable Conversion</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ADC10ON</name>
              <description>[4:4] ADC10 On/enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ADC10MSC</name>
              <description>[7:7] ADC10 Multiple SampleConversion</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ADC10SHT</name>
              <description>[11:8] ADC10 Sample Hold Select Bit: 0</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10SHT_0</name>
                  <value>0</value>
                  <description>ADC10 Sample Hold Select 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_1</name>
                  <value>1</value>
                  <description>ADC10 Sample Hold Select 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_2</name>
                  <value>2</value>
                  <description>ADC10 Sample Hold Select 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_3</name>
                  <value>3</value>
                  <description>ADC10 Sample Hold Select 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_4</name>
                  <value>4</value>
                  <description>ADC10 Sample Hold Select 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_5</name>
                  <value>5</value>
                  <description>ADC10 Sample Hold Select 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_6</name>
                  <value>6</value>
                  <description>ADC10 Sample Hold Select 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_7</name>
                  <value>7</value>
                  <description>ADC10 Sample Hold Select 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_8</name>
                  <value>8</value>
                  <description>ADC10 Sample Hold Select 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_9</name>
                  <value>9</value>
                  <description>ADC10 Sample Hold Select 9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_10</name>
                  <value>10</value>
                  <description>ADC10 Sample Hold Select 10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_11</name>
                  <value>11</value>
                  <description>ADC10 Sample Hold Select 11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_12</name>
                  <value>12</value>
                  <description>ADC10 Sample Hold Select 12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_13</name>
                  <value>13</value>
                  <description>ADC10 Sample Hold Select 13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_14</name>
                  <value>14</value>
                  <description>ADC10 Sample Hold Select 14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_15</name>
                  <value>15</value>
                  <description>ADC10 Sample Hold Select 15</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADC10CTL1</name>
          <addressOffset>0x0702</addressOffset>
          <size>16</size>
          <description>ADC10 Control 1</description>
          <fields>
            <field>
              <name>ADC10BUSY</name>
              <description>[0:0] ADC10 Busy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>ADC10CONSEQ</name>
              <description>[2:1] ADC10 Conversion Sequence Select 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10CONSEQ_0</name>
                  <value>0</value>
                  <description>ADC10 Conversion Sequence Select: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10CONSEQ_1</name>
                  <value>1</value>
                  <description>ADC10 Conversion Sequence Select: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10CONSEQ_2</name>
                  <value>2</value>
                  <description>ADC10 Conversion Sequence Select: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10CONSEQ_3</name>
                  <value>3</value>
                  <description>ADC10 Conversion Sequence Select: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC10SSEL</name>
              <description>[4:3] ADC10 Clock Source Select 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10SSEL_0</name>
                  <value>0</value>
                  <description>ADC10 Clock Source Select: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SSEL_1</name>
                  <value>1</value>
                  <description>ADC10 Clock Source Select: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SSEL_2</name>
                  <value>2</value>
                  <description>ADC10 Clock Source Select: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SSEL_3</name>
                  <value>3</value>
                  <description>ADC10 Clock Source Select: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC10DIV</name>
              <description>[7:5] ADC10 Clock Divider Select 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10DIV_0</name>
                  <value>0</value>
                  <description>ADC10 Clock Divider Select: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_1</name>
                  <value>1</value>
                  <description>ADC10 Clock Divider Select: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_2</name>
                  <value>2</value>
                  <description>ADC10 Clock Divider Select: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_3</name>
                  <value>3</value>
                  <description>ADC10 Clock Divider Select: 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_4</name>
                  <value>4</value>
                  <description>ADC10 Clock Divider Select: 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_5</name>
                  <value>5</value>
                  <description>ADC10 Clock Divider Select: 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_6</name>
                  <value>6</value>
                  <description>ADC10 Clock Divider Select: 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_7</name>
                  <value>7</value>
                  <description>ADC10 Clock Divider Select: 7</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC10ISSH</name>
              <description>[8:8] ADC10 Invert Sample Hold Signal</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC10SHP</name>
              <description>[9:9] ADC10 Sample/Hold Pulse Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>ADC10SHS</name>
              <description>[11:10] ADC10 Sample/Hold Source 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10SHS_0</name>
                  <value>0</value>
                  <description>ADC10 Sample/Hold Source: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHS_1</name>
                  <value>1</value>
                  <description>ADC10 Sample/Hold Source: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHS_2</name>
                  <value>2</value>
                  <description>ADC10 Sample/Hold Source: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHS_3</name>
                  <value>3</value>
                  <description>ADC10 Sample/Hold Source: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADC10CTL2</name>
          <addressOffset>0x0704</addressOffset>
          <size>16</size>
          <description>ADC10 Control 2</description>
          <fields>
            <field>
              <name>ADC10REFBURST</name>
              <description>[0:0] ADC10 Reference Burst</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>ADC10SR</name>
              <description>[2:2] ADC10 Sampling Rate</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ADC10DF</name>
              <description>[3:3] ADC10 Data Format</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>ADC10RES</name>
              <description>[4:4] ADC10 Resolution Bit</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ADC10PDIV</name>
              <description>[9:8] ADC10 predivider Bit: 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10PDIV_0</name>
                  <value>0</value>
                  <description>ADC10 predivider /1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10PDIV_1</name>
                  <value>1</value>
                  <description>ADC10 predivider /2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10PDIV_2</name>
                  <value>2</value>
                  <description>ADC10 predivider /64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10PDIV_3</name>
                  <value>3</value>
                  <description>ADC10 predivider reserved</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADC10LO</name>
          <addressOffset>0x0706</addressOffset>
          <size>16</size>
          <description>ADC10 Window Comparator High Threshold</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC10HI</name>
          <addressOffset>0x0708</addressOffset>
          <size>16</size>
          <description>ADC10 Window Comparator High Threshold</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC10MCTL0</name>
          <addressOffset>0x070A</addressOffset>
          <size>16</size>
          <description>ADC10 Memory Control 0</description>
          <fields>
            <field>
              <name>ADC10INCH</name>
              <description>[3:0] ADC10 Input Channel Select Bit 0</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10INCH_0</name>
                  <value>0</value>
                  <description>ADC10 Input Channel 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_1</name>
                  <value>1</value>
                  <description>ADC10 Input Channel 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_2</name>
                  <value>2</value>
                  <description>ADC10 Input Channel 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_3</name>
                  <value>3</value>
                  <description>ADC10 Input Channel 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_4</name>
                  <value>4</value>
                  <description>ADC10 Input Channel 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_5</name>
                  <value>5</value>
                  <description>ADC10 Input Channel 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_6</name>
                  <value>6</value>
                  <description>ADC10 Input Channel 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_7</name>
                  <value>7</value>
                  <description>ADC10 Input Channel 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_8</name>
                  <value>8</value>
                  <description>ADC10 Input Channel 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_9</name>
                  <value>9</value>
                  <description>ADC10 Input Channel 9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_10</name>
                  <value>10</value>
                  <description>ADC10 Input Channel 10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_11</name>
                  <value>11</value>
                  <description>ADC10 Input Channel 11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_12</name>
                  <value>12</value>
                  <description>ADC10 Input Channel 12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_13</name>
                  <value>13</value>
                  <description>ADC10 Input Channel 13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_14</name>
                  <value>14</value>
                  <description>ADC10 Input Channel 14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10INCH_15</name>
                  <value>15</value>
                  <description>ADC10 Input Channel 15</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC10SREF</name>
              <description>[6:4] ADC10 Select Reference Bit 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10SREF_0</name>
                  <value>0</value>
                  <description>ADC10 Select Reference 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SREF_1</name>
                  <value>1</value>
                  <description>ADC10 Select Reference 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SREF_2</name>
                  <value>2</value>
                  <description>ADC10 Select Reference 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SREF_3</name>
                  <value>3</value>
                  <description>ADC10 Select Reference 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SREF_4</name>
                  <value>4</value>
                  <description>ADC10 Select Reference 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SREF_5</name>
                  <value>5</value>
                  <description>ADC10 Select Reference 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SREF_6</name>
                  <value>6</value>
                  <description>ADC10 Select Reference 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SREF_7</name>
                  <value>7</value>
                  <description>ADC10 Select Reference 7</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADC10MEM0</name>
          <addressOffset>0x0712</addressOffset>
          <size>16</size>
          <description>ADC10 Conversion Memory 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC10IE</name>
          <addressOffset>0x071A</addressOffset>
          <size>16</size>
          <description>ADC10 Interrupt Enable</description>
          <fields>
            <field>
              <name>ADC10IE0</name>
              <description>[0:0] ADC10_A Interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>ADC10INIE</name>
              <description>[1:1] ADC10_A Interrupt enable for the inside of window of the Window comparator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ADC10LOIE</name>
              <description>[2:2] ADC10_A Interrupt enable for lower threshold of the Window comparator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ADC10HIIE</name>
              <description>[3:3] ADC10_A Interrupt enable for upper threshold of the Window comparator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>ADC10OVIE</name>
              <description>[4:4] ADC10_A ADC10MEM overflow Interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ADC10TOVIE</name>
              <description>[5:5] ADC10_A conversion-time-overflow Interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
