MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>ADC10IFG</name>
          <addressOffset>0x071C</addressOffset>
          <size>16</size>
          <description>ADC10 Interrupt Flag</description>
          <fields>
            <field>
              <name>ADC10IFG0</name>
              <description>[0:0] ADC10_A Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>ADC10INIFG</name>
              <description>[1:1] ADC10_A Interrupt Flag for the inside of window of the Window comparator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ADC10LOIFG</name>
              <description>[2:2] ADC10_A Interrupt Flag for lower threshold of the Window comparator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ADC10HIIFG</name>
              <description>[3:3] ADC10_A Interrupt Flag for upper threshold of the Window comparator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>ADC10OVIFG</name>
              <description>[4:4] ADC10_A ADC10MEM overflow Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ADC10TOVIFG</name>
              <description>[5:5] ADC10_A conversion-time-overflow Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADC10IV</name>
          <addressOffset>0x071E</addressOffset>
          <size>16</size>
          <description>ADC10 Interrupt Vector Word</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CS__Clock_System</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>CS  Clock System</description>
      <registers>
        <register>
          <name>CSCTL0</name>
          <addressOffset>0x0160</addressOffset>
          <size>16</size>
          <description>CS Control Register 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSCTL1</name>
          <addressOffset>0x0162</addressOffset>
          <size>16</size>
          <description>CS Control Register 1</description>
          <fields>
            <field>
              <name>DCOFSEL</name>
              <description>[2:1] DCO frequency select Bit: 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOFSEL_0</name>
                  <value>0</value>
                  <description>DCO frequency select: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_1</name>
                  <value>1</value>
                  <description>DCO frequency select: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_2</name>
                  <value>2</value>
                  <description>DCO frequency select: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_3</name>
                  <value>3</value>
                  <description>DCO frequency select: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCORSEL</name>
              <description>[7:7] DCO range select.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CSCTL2</name>
          <addressOffset>0x0164</addressOffset>
          <size>16</size>
          <description>CS Control Register 2</description>
          <fields>
            <field>
              <name>SELM</name>
              <description>[2:0] MCLK Source Select Bit: 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELM_0</name>
                  <value>0</value>
                  <description>MCLK Source Select 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_1</name>
                  <value>1</value>
                  <description>MCLK Source Select 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_2</name>
                  <value>2</value>
                  <description>MCLK Source Select 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_3</name>
                  <value>3</value>
                  <description>MCLK Source Select 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_4</name>
                  <value>4</value>
                  <description>MCLK Source Select 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_5</name>
                  <value>5</value>
                  <description>MCLK Source Select 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_6</name>
                  <value>6</value>
                  <description>MCLK Source Select 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_7</name>
                  <value>7</value>
                  <description>MCLK Source Select 7</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELS</name>
              <description>[6:4] SMCLK Source Select Bit: 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELS_0</name>
                  <value>0</value>
                  <description>SMCLK Source Select 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_1</name>
                  <value>1</value>
                  <description>SMCLK Source Select 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_2</name>
                  <value>2</value>
                  <description>SMCLK Source Select 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_3</name>
                  <value>3</value>
                  <description>SMCLK Source Select 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_4</name>
                  <value>4</value>
                  <description>SMCLK Source Select 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_5</name>
                  <value>5</value>
                  <description>SMCLK Source Select 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_6</name>
                  <value>6</value>
                  <description>SMCLK Source Select 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_7</name>
                  <value>7</value>
                  <description>SMCLK Source Select 7</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELA</name>
              <description>[10:8] ACLK Source Select Bit: 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELA_0</name>
                  <value>0</value>
                  <description>ACLK Source Select 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_1</name>
                  <value>1</value>
                  <description>ACLK Source Select 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_2</name>
                  <value>2</value>
                  <description>ACLK Source Select 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_3</name>
                  <value>3</value>
                  <description>ACLK Source Select 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_4</name>
                  <value>4</value>
                  <description>ACLK Source Select 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_5</name>
                  <value>5</value>
                  <description>ACLK Source Select 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_6</name>
                  <value>6</value>
                  <description>ACLK Source Select 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_7</name>
                  <value>7</value>
                  <description>ACLK Source Select 7</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CSCTL3</name>
          <addressOffset>0x0166</addressOffset>
          <size>16</size>
          <description>CS Control Register 3</description>
          <fields>
            <field>
              <name>DIVM</name>
              <description>[2:0] MCLK Divider Bit: 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVM_0</name>
                  <value>0</value>
                  <description>MCLK Source Divider 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_1</name>
                  <value>1</value>
                  <description>MCLK Source Divider 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_2</name>
                  <value>2</value>
                  <description>MCLK Source Divider 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_3</name>
                  <value>3</value>
                  <description>MCLK Source Divider 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_4</name>
                  <value>4</value>
                  <description>MCLK Source Divider 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_5</name>
                  <value>5</value>
                  <description>MCLK Source Divider 5</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVS</name>
              <description>[6:4] SMCLK Divider Bit: 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVS_0</name>
                  <value>0</value>
                  <description>SMCLK Source Divider 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_1</name>
                  <value>1</value>
                  <description>SMCLK Source Divider 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_2</name>
                  <value>2</value>
                  <description>SMCLK Source Divider 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_3</name>
                  <value>3</value>
                  <description>SMCLK Source Divider 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_4</name>
                  <value>4</value>
                  <description>SMCLK Source Divider 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_5</name>
                  <value>5</value>
                  <description>SMCLK Source Divider 5</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVA</name>
              <description>[10:8] ACLK Divider Bit: 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVA_0</name>
                  <value>0</value>
                  <description>ACLK Source Divider 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_1</name>
                  <value>1</value>
                  <description>ACLK Source Divider 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_2</name>
                  <value>2</value>
                  <description>ACLK Source Divider 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_3</name>
                  <value>3</value>
                  <description>ACLK Source Divider 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_4</name>
                  <value>4</value>
                  <description>ACLK Source Divider 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_5</name>
                  <value>5</value>
                  <description>ACLK Source Divider 5</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CSCTL4</name>
          <addressOffset>0x0168</addressOffset>
          <size>16</size>
          <description>CS Control Register 4</description>
          <fields>
            <field>
              <name>XT1OFF</name>
              <description>[0:0] High Frequency Oscillator 1 (XT1) disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>SMCLKOFF</name>
              <description>[1:1] SMCLK Off</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>XT1BYPASS</name>
              <description>[4:4] XT1 bypass mode : 0: internal 1:sourced from external pin</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>XTS</name>
              <description>[5:5] 1: Selects high-freq. oscillator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>XT1DRIVE</name>
              <description>[7:6] XT1 Drive Level mode Bit 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1DRIVE_0</name>
                  <value>0</value>
                  <description>XT1 Drive Level mode: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_1</name>
                  <value>1</value>
                  <description>XT1 Drive Level mode: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_2</name>
                  <value>2</value>
                  <description>XT1 Drive Level mode: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_3</name>
                  <value>3</value>
                  <description>XT1 Drive Level mode: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT2OFF</name>
              <description>[8:8] High Frequency Oscillator 2 (XT2) disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>XT2BYPASS</name>
              <description>[12:12] XT2 bypass mode : 0: internal 1:sourced from external pin</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>XT2DRIVE</name>
              <description>[15:14] XT2 Drive Level mode Bit 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT2DRIVE_0</name>
                  <value>0</value>
                  <description>XT2 Drive Level mode: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT2DRIVE_1</name>
                  <value>1</value>
                  <description>XT2 Drive Level mode: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT2DRIVE_2</name>
                  <value>2</value>
                  <description>XT2 Drive Level mode: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT2DRIVE_3</name>
                  <value>3</value>
                  <description>XT2 Drive Level mode: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CSCTL5</name>
          <addressOffset>0x016A</addressOffset>
          <size>16</size>
          <description>CS Control Register 5</description>
          <fields>
            <field>
              <name>XT1OFFG</name>
              <description>[0:0] XT1 Low Frequency Oscillator Fault Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>XT2OFFG</name>
              <description>[1:1] High Frequency Oscillator 2 Fault Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENSTFCNT1</name>
              <description>[6:6] Enable start counter for XT1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ENSTFCNT2</name>
              <description>[7:7] Enable start counter for XT2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CSCTL6</name>
          <addressOffset>0x016C</addressOffset>
          <size>16</size>
          <description>CS Control Register 6</description>
          <fields>
            <field>
              <name>ACLKREQEN</name>
              <description>[0:0] ACLK Clock Request Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MCLKREQEN</name>
              <description>[1:1] MCLK Clock Request Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SMCLKREQEN</name>
              <description>[2:2] SMCLK Clock Request Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MODCLKREQEN</name>
              <description>[3:3] MODOSC Clock Request Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
