MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Comparator_D</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Comparator D</description>
      <registers>
        <register>
          <name>CDCTL0</name>
          <addressOffset>0x08C0</addressOffset>
          <size>16</size>
          <description>Comparator D Control Register 0</description>
          <fields>
            <field>
              <name>CDIPSEL</name>
              <description>[3:0] Comp. D Pos. Channel Input Select 0</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDIPSEL_0</name>
                  <value>0</value>
                  <description>Comp. D V+ terminal Input Select: Channel 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_1</name>
                  <value>1</value>
                  <description>Comp. D V+ terminal Input Select: Channel 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_2</name>
                  <value>2</value>
                  <description>Comp. D V+ terminal Input Select: Channel 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_3</name>
                  <value>3</value>
                  <description>Comp. D V+ terminal Input Select: Channel 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_4</name>
                  <value>4</value>
                  <description>Comp. D V+ terminal Input Select: Channel 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_5</name>
                  <value>5</value>
                  <description>Comp. D V+ terminal Input Select: Channel 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_6</name>
                  <value>6</value>
                  <description>Comp. D V+ terminal Input Select: Channel 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_7</name>
                  <value>7</value>
                  <description>Comp. D V+ terminal Input Select: Channel 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_8</name>
                  <value>8</value>
                  <description>Comp. D V+ terminal Input Select: Channel 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_9</name>
                  <value>9</value>
                  <description>Comp. D V+ terminal Input Select: Channel 9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_10</name>
                  <value>10</value>
                  <description>Comp. D V+ terminal Input Select: Channel 10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_11</name>
                  <value>11</value>
                  <description>Comp. D V+ terminal Input Select: Channel 11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_12</name>
                  <value>12</value>
                  <description>Comp. D V+ terminal Input Select: Channel 12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_13</name>
                  <value>13</value>
                  <description>Comp. D V+ terminal Input Select: Channel 13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_14</name>
                  <value>14</value>
                  <description>Comp. D V+ terminal Input Select: Channel 14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIPSEL_15</name>
                  <value>15</value>
                  <description>Comp. D V+ terminal Input Select: Channel 15</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDIPEN</name>
              <description>[7:7] Comp. D Pos. Channel Input Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CDIMSEL</name>
              <description>[11:8] Comp. D Neg. Channel Input Select 0</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDIMSEL_0</name>
                  <value>0</value>
                  <description>Comp. D V- Terminal Input Select: Channel 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_1</name>
                  <value>1</value>
                  <description>Comp. D V- Terminal Input Select: Channel 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_2</name>
                  <value>2</value>
                  <description>Comp. D V- Terminal Input Select: Channel 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_3</name>
                  <value>3</value>
                  <description>Comp. D V- Terminal Input Select: Channel 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_4</name>
                  <value>4</value>
                  <description>Comp. D V- Terminal Input Select: Channel 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_5</name>
                  <value>5</value>
                  <description>Comp. D V- Terminal Input Select: Channel 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_6</name>
                  <value>6</value>
                  <description>Comp. D V- Terminal Input Select: Channel 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_7</name>
                  <value>7</value>
                  <description>Comp. D V- Terminal Input Select: Channel 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_8</name>
                  <value>8</value>
                  <description>Comp. D V- terminal Input Select: Channel 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_9</name>
                  <value>9</value>
                  <description>Comp. D V- terminal Input Select: Channel 9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_10</name>
                  <value>10</value>
                  <description>Comp. D V- terminal Input Select: Channel 10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_11</name>
                  <value>11</value>
                  <description>Comp. D V- terminal Input Select: Channel 11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_12</name>
                  <value>12</value>
                  <description>Comp. D V- terminal Input Select: Channel 12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_13</name>
                  <value>13</value>
                  <description>Comp. D V- terminal Input Select: Channel 13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_14</name>
                  <value>14</value>
                  <description>Comp. D V- terminal Input Select: Channel 14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIMSEL_15</name>
                  <value>15</value>
                  <description>Comp. D V- terminal Input Select: Channel 15</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDIMEN</name>
              <description>[15:15] Comp. D Neg. Channel Input Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CDCTL1</name>
          <addressOffset>0x08C2</addressOffset>
          <size>16</size>
          <description>Comparator D Control Register 1</description>
          <fields>
            <field>
              <name>CDOUT</name>
              <description>[0:0] Comp. D Output</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>CDOUTPOL</name>
              <description>[1:1] Comp. D Output Polarity</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CDF</name>
              <description>[2:2] Comp. D Enable Output Filter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CDIES</name>
              <description>[3:3] Comp. D Interrupt Edge Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CDSHORT</name>
              <description>[4:4] Comp. D Input Short</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CDEX</name>
              <description>[5:5] Comp. D Exchange Inputs</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CDFDLY</name>
              <description>[7:6] Comp. D Filter delay Bit 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDFDLY_0</name>
                  <value>0</value>
                  <description>Comp. D Filter delay 0 : 450ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDFDLY_1</name>
                  <value>1</value>
                  <description>Comp. D Filter delay 1 : 900ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDFDLY_2</name>
                  <value>2</value>
                  <description>Comp. D Filter delay 2 : 1800ns</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDFDLY_3</name>
                  <value>3</value>
                  <description>Comp. D Filter delay 3 : 3600ns</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDON</name>
              <description>[10:10] Comp. D enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CDMRVL</name>
              <description>[11:11] Comp. D CDMRV Level</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CDMRVS</name>
              <description>[12:12] Comp. D Output selects between VREF0 or VREF1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
