MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>CDCTL2</name>
          <addressOffset>0x08C4</addressOffset>
          <size>16</size>
          <description>Comparator D Control Register 2</description>
          <fields>
            <field>
              <name>CDREF0</name>
              <description>[4:0] Comp. D Reference 0 Resistor Select Bit : 0</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDREF0_0</name>
                  <value>0</value>
                  <description>Comp. D Int. Ref.0 Select 0 : 1/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_1</name>
                  <value>1</value>
                  <description>Comp. D Int. Ref.0 Select 1 : 2/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_2</name>
                  <value>2</value>
                  <description>Comp. D Int. Ref.0 Select 2 : 3/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_3</name>
                  <value>3</value>
                  <description>Comp. D Int. Ref.0 Select 3 : 4/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_4</name>
                  <value>4</value>
                  <description>Comp. D Int. Ref.0 Select 4 : 5/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_5</name>
                  <value>5</value>
                  <description>Comp. D Int. Ref.0 Select 5 : 6/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_6</name>
                  <value>6</value>
                  <description>Comp. D Int. Ref.0 Select 6 : 7/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_7</name>
                  <value>7</value>
                  <description>Comp. D Int. Ref.0 Select 7 : 8/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_8</name>
                  <value>8</value>
                  <description>Comp. D Int. Ref.0 Select 0 : 9/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_9</name>
                  <value>9</value>
                  <description>Comp. D Int. Ref.0 Select 1 : 10/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_10</name>
                  <value>10</value>
                  <description>Comp. D Int. Ref.0 Select 2 : 11/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_11</name>
                  <value>11</value>
                  <description>Comp. D Int. Ref.0 Select 3 : 12/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_12</name>
                  <value>12</value>
                  <description>Comp. D Int. Ref.0 Select 4 : 13/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_13</name>
                  <value>13</value>
                  <description>Comp. D Int. Ref.0 Select 5 : 14/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_14</name>
                  <value>14</value>
                  <description>Comp. D Int. Ref.0 Select 6 : 15/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_15</name>
                  <value>15</value>
                  <description>Comp. D Int. Ref.0 Select 7 : 16/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_16</name>
                  <value>16</value>
                  <description>Comp. D Int. Ref.0 Select 0 : 17/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_17</name>
                  <value>17</value>
                  <description>Comp. D Int. Ref.0 Select 1 : 18/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_18</name>
                  <value>18</value>
                  <description>Comp. D Int. Ref.0 Select 2 : 19/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_19</name>
                  <value>19</value>
                  <description>Comp. D Int. Ref.0 Select 3 : 20/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_20</name>
                  <value>20</value>
                  <description>Comp. D Int. Ref.0 Select 4 : 21/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_21</name>
                  <value>21</value>
                  <description>Comp. D Int. Ref.0 Select 5 : 22/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_22</name>
                  <value>22</value>
                  <description>Comp. D Int. Ref.0 Select 6 : 23/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_23</name>
                  <value>23</value>
                  <description>Comp. D Int. Ref.0 Select 7 : 24/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_24</name>
                  <value>24</value>
                  <description>Comp. D Int. Ref.0 Select 0 : 25/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_25</name>
                  <value>25</value>
                  <description>Comp. D Int. Ref.0 Select 1 : 26/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_26</name>
                  <value>26</value>
                  <description>Comp. D Int. Ref.0 Select 2 : 27/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_27</name>
                  <value>27</value>
                  <description>Comp. D Int. Ref.0 Select 3 : 28/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_28</name>
                  <value>28</value>
                  <description>Comp. D Int. Ref.0 Select 4 : 29/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_29</name>
                  <value>29</value>
                  <description>Comp. D Int. Ref.0 Select 5 : 30/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_30</name>
                  <value>30</value>
                  <description>Comp. D Int. Ref.0 Select 6 : 31/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF0_31</name>
                  <value>31</value>
                  <description>Comp. D Int. Ref.0 Select 7 : 32/32</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDRSEL</name>
              <description>[5:5] Comp. D Reference select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CDRS</name>
              <description>[7:6] Comp. D Reference Source Bit : 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDRS_0</name>
                  <value>0</value>
                  <description>Comp. D Reference Source 0 : Off</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDRS_1</name>
                  <value>1</value>
                  <description>Comp. D Reference Source 1 : Vcc</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDRS_2</name>
                  <value>2</value>
                  <description>Comp. D Reference Source 2 : Shared Ref.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDRS_3</name>
                  <value>3</value>
                  <description>Comp. D Reference Source 3 : Shared Ref. / Off</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDREF1</name>
              <description>[12:8] Comp. D Reference 1 Resistor Select Bit : 0</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDREF1_0</name>
                  <value>0</value>
                  <description>Comp. D Int. Ref.1 Select 0 : 1/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_1</name>
                  <value>1</value>
                  <description>Comp. D Int. Ref.1 Select 1 : 2/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_2</name>
                  <value>2</value>
                  <description>Comp. D Int. Ref.1 Select 2 : 3/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_3</name>
                  <value>3</value>
                  <description>Comp. D Int. Ref.1 Select 3 : 4/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_4</name>
                  <value>4</value>
                  <description>Comp. D Int. Ref.1 Select 4 : 5/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_5</name>
                  <value>5</value>
                  <description>Comp. D Int. Ref.1 Select 5 : 6/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_6</name>
                  <value>6</value>
                  <description>Comp. D Int. Ref.1 Select 6 : 7/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_7</name>
                  <value>7</value>
                  <description>Comp. D Int. Ref.1 Select 7 : 8/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_8</name>
                  <value>8</value>
                  <description>Comp. D Int. Ref.1 Select 0 : 9/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_9</name>
                  <value>9</value>
                  <description>Comp. D Int. Ref.1 Select 1 : 10/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_10</name>
                  <value>10</value>
                  <description>Comp. D Int. Ref.1 Select 2 : 11/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_11</name>
                  <value>11</value>
                  <description>Comp. D Int. Ref.1 Select 3 : 12/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_12</name>
                  <value>12</value>
                  <description>Comp. D Int. Ref.1 Select 4 : 13/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_13</name>
                  <value>13</value>
                  <description>Comp. D Int. Ref.1 Select 5 : 14/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_14</name>
                  <value>14</value>
                  <description>Comp. D Int. Ref.1 Select 6 : 15/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_15</name>
                  <value>15</value>
                  <description>Comp. D Int. Ref.1 Select 7 : 16/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_16</name>
                  <value>16</value>
                  <description>Comp. D Int. Ref.1 Select 0 : 17/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_17</name>
                  <value>17</value>
                  <description>Comp. D Int. Ref.1 Select 1 : 18/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_18</name>
                  <value>18</value>
                  <description>Comp. D Int. Ref.1 Select 2 : 19/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_19</name>
                  <value>19</value>
                  <description>Comp. D Int. Ref.1 Select 3 : 20/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_20</name>
                  <value>20</value>
                  <description>Comp. D Int. Ref.1 Select 4 : 21/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_21</name>
                  <value>21</value>
                  <description>Comp. D Int. Ref.1 Select 5 : 22/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_22</name>
                  <value>22</value>
                  <description>Comp. D Int. Ref.1 Select 6 : 23/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_23</name>
                  <value>23</value>
                  <description>Comp. D Int. Ref.1 Select 7 : 24/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_24</name>
                  <value>24</value>
                  <description>Comp. D Int. Ref.1 Select 0 : 25/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_25</name>
                  <value>25</value>
                  <description>Comp. D Int. Ref.1 Select 1 : 26/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_26</name>
                  <value>26</value>
                  <description>Comp. D Int. Ref.1 Select 2 : 27/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_27</name>
                  <value>27</value>
                  <description>Comp. D Int. Ref.1 Select 3 : 28/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_28</name>
                  <value>28</value>
                  <description>Comp. D Int. Ref.1 Select 4 : 29/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_29</name>
                  <value>29</value>
                  <description>Comp. D Int. Ref.1 Select 5 : 30/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_30</name>
                  <value>30</value>
                  <description>Comp. D Int. Ref.1 Select 6 : 31/32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREF1_31</name>
                  <value>31</value>
                  <description>Comp. D Int. Ref.1 Select 7 : 32/32</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDREFL</name>
              <description>[14:13] Comp. D Reference voltage level Bit : 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDREFL_0</name>
                  <value>0</value>
                  <description>Comp. D Reference voltage level 0 : None</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREFL_1</name>
                  <value>1</value>
                  <description>Comp. D Reference voltage level 1 : 1.5V</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREFL_2</name>
                  <value>2</value>
                  <description>Comp. D Reference voltage level 2 : 2.0V</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDREFL_3</name>
                  <value>3</value>
                  <description>Comp. D Reference voltage level 3 : 2.5V</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDREFACC</name>
              <description>[15:15] Comp. D Reference Accuracy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CDCTL3</name>
          <addressOffset>0x08C6</addressOffset>
          <size>16</size>
          <description>Comparator D Control Register 3</description>
          <fields>
            <field>
              <name>CDPD0</name>
              <description>[0:0] Comp. D Disable Input Buffer of Port Register .0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>CDPD1</name>
              <description>[1:1] Comp. D Disable Input Buffer of Port Register .1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CDPD2</name>
              <description>[2:2] Comp. D Disable Input Buffer of Port Register .2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CDPD3</name>
              <description>[3:3] Comp. D Disable Input Buffer of Port Register .3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CDPD4</name>
              <description>[4:4] Comp. D Disable Input Buffer of Port Register .4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CDPD5</name>
              <description>[5:5] Comp. D Disable Input Buffer of Port Register .5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CDPD6</name>
              <description>[6:6] Comp. D Disable Input Buffer of Port Register .6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CDPD7</name>
              <description>[7:7] Comp. D Disable Input Buffer of Port Register .7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CDPD8</name>
              <description>[8:8] Comp. D Disable Input Buffer of Port Register .8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CDPD9</name>
              <description>[9:9] Comp. D Disable Input Buffer of Port Register .9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>CDPD10</name>
              <description>[10:10] Comp. D Disable Input Buffer of Port Register .10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CDPD11</name>
              <description>[11:11] Comp. D Disable Input Buffer of Port Register .11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CDPD12</name>
              <description>[12:12] Comp. D Disable Input Buffer of Port Register .12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>CDPD13</name>
              <description>[13:13] Comp. D Disable Input Buffer of Port Register .13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>CDPD14</name>
              <description>[14:14] Comp. D Disable Input Buffer of Port Register .14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>CDPD15</name>
              <description>[15:15] Comp. D Disable Input Buffer of Port Register .15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CDINT</name>
          <addressOffset>0x08CC</addressOffset>
          <size>16</size>
          <description>Comparator D Interrupt Register</description>
          <fields>
            <field>
              <name>CDIFG</name>
              <description>[0:0] Comp. D Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>CDIIFG</name>
              <description>[1:1] Comp. D Interrupt Flag Inverted Polarity</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CDIE</name>
              <description>[8:8] Comp. D Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CDIIE</name>
              <description>[9:9] Comp. D Interrupt Enable Inverted Polarity</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CDIV</name>
          <addressOffset>0x08CE</addressOffset>
          <size>16</size>
          <description>Comparator D Interrupt Vector Word</description>
          <resetValue>0</resetValue>
        </register>
