MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC16</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>CRC16</description>
      <registers>
        <register>
          <name>CRCDI</name>
          <addressOffset>0x0150</addressOffset>
          <size>16</size>
          <description>CRC Data In Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRCDIRB</name>
          <addressOffset>0x0152</addressOffset>
          <size>16</size>
          <description>CRC data in reverse byte Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRCINIRES</name>
          <addressOffset>0x0154</addressOffset>
          <size>16</size>
          <description>CRC Initialisation Register and Result Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRCRESR</name>
          <addressOffset>0x0156</addressOffset>
          <size>16</size>
          <description>CRC reverse result Register</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>DMA</description>
      <registers>
        <register>
          <name>DMACTL0</name>
          <addressOffset>0x0500</addressOffset>
          <size>16</size>
          <description>DMA Module Control 0</description>
          <fields>
            <field>
              <name>DMA0TSEL</name>
              <description>[4:0] DMA channel 0 transfer select bit 0</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA0TSEL_0</name>
                  <value>0</value>
                  <description>DMA channel 0 transfer select 0:  DMA_REQ (sw)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_1</name>
                  <value>1</value>
                  <description>DMA channel 0 transfer select 1:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_2</name>
                  <value>2</value>
                  <description>DMA channel 0 transfer select 2:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_3</name>
                  <value>3</value>
                  <description>DMA channel 0 transfer select 3:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_4</name>
                  <value>4</value>
                  <description>DMA channel 0 transfer select 4:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_5</name>
                  <value>5</value>
                  <description>DMA channel 0 transfer select 5:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_6</name>
                  <value>6</value>
                  <description>DMA channel 0 transfer select 6:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_7</name>
                  <value>7</value>
                  <description>DMA channel 0 transfer select 7:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_8</name>
                  <value>8</value>
                  <description>DMA channel 0 transfer select 8:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_9</name>
                  <value>9</value>
                  <description>DMA channel 0 transfer select 9:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_10</name>
                  <value>10</value>
                  <description>DMA channel 0 transfer select 10:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_11</name>
                  <value>11</value>
                  <description>DMA channel 0 transfer select 11:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_12</name>
                  <value>12</value>
                  <description>DMA channel 0 transfer select 12:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_13</name>
                  <value>13</value>
                  <description>DMA channel 0 transfer select 13:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_14</name>
                  <value>14</value>
                  <description>DMA channel 0 transfer select 14:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_15</name>
                  <value>15</value>
                  <description>DMA channel 0 transfer select 15:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_16</name>
                  <value>16</value>
                  <description>DMA channel 0 transfer select 16:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_17</name>
                  <value>17</value>
                  <description>DMA channel 0 transfer select 17:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_18</name>
                  <value>18</value>
                  <description>DMA channel 0 transfer select 18:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_19</name>
                  <value>19</value>
                  <description>DMA channel 0 transfer select 19:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_20</name>
                  <value>20</value>
                  <description>DMA channel 0 transfer select 20:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_21</name>
                  <value>21</value>
                  <description>DMA channel 0 transfer select 21:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_22</name>
                  <value>22</value>
                  <description>DMA channel 0 transfer select 22:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_23</name>
                  <value>23</value>
                  <description>DMA channel 0 transfer select 23:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_24</name>
                  <value>24</value>
                  <description>DMA channel 0 transfer select 24:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_25</name>
                  <value>25</value>
                  <description>DMA channel 0 transfer select 25:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_26</name>
                  <value>26</value>
                  <description>DMA channel 0 transfer select 26:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_27</name>
                  <value>27</value>
                  <description>DMA channel 0 transfer select 27:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_28</name>
                  <value>28</value>
                  <description>DMA channel 0 transfer select 28:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_29</name>
                  <value>29</value>
                  <description>DMA channel 0 transfer select 29:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_30</name>
                  <value>30</value>
                  <description>DMA channel 0 transfer select 30: previous DMA channel DMA2IFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_31</name>
                  <value>31</value>
                  <description>DMA channel 0 transfer select 31: ext. Trigger (DMAE0)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA1TSEL</name>
              <description>[12:8] DMA channel 1 transfer select bit 0</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA1TSEL_0</name>
                  <value>0</value>
                  <description>DMA channel 1 transfer select 0:  DMA_REQ (sw)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_1</name>
                  <value>1</value>
                  <description>DMA channel 1 transfer select 1:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_2</name>
                  <value>2</value>
                  <description>DMA channel 1 transfer select 2:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_3</name>
                  <value>3</value>
                  <description>DMA channel 1 transfer select 3:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_4</name>
                  <value>4</value>
                  <description>DMA channel 1 transfer select 4:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_5</name>
                  <value>5</value>
                  <description>DMA channel 1 transfer select 5:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_6</name>
                  <value>6</value>
                  <description>DMA channel 1 transfer select 6:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_7</name>
                  <value>7</value>
                  <description>DMA channel 1 transfer select 7:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_8</name>
                  <value>8</value>
                  <description>DMA channel 1 transfer select 8:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_9</name>
                  <value>9</value>
                  <description>DMA channel 1 transfer select 9:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_10</name>
                  <value>10</value>
                  <description>DMA channel 1 transfer select 10:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_11</name>
                  <value>11</value>
                  <description>DMA channel 1 transfer select 11:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_12</name>
                  <value>12</value>
                  <description>DMA channel 1 transfer select 12:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_13</name>
                  <value>13</value>
                  <description>DMA channel 1 transfer select 13:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_14</name>
                  <value>14</value>
                  <description>DMA channel 1 transfer select 14:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_15</name>
                  <value>15</value>
                  <description>DMA channel 1 transfer select 15:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_16</name>
                  <value>16</value>
                  <description>DMA channel 1 transfer select 16:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_17</name>
                  <value>17</value>
                  <description>DMA channel 1 transfer select 17:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_18</name>
                  <value>18</value>
                  <description>DMA channel 1 transfer select 18:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_19</name>
                  <value>19</value>
                  <description>DMA channel 1 transfer select 19:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_20</name>
                  <value>20</value>
                  <description>DMA channel 1 transfer select 20:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_21</name>
                  <value>21</value>
                  <description>DMA channel 1 transfer select 21:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_22</name>
                  <value>22</value>
                  <description>DMA channel 1 transfer select 22:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_23</name>
                  <value>23</value>
                  <description>DMA channel 1 transfer select 23:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_24</name>
                  <value>24</value>
                  <description>DMA channel 1 transfer select 24:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_25</name>
                  <value>25</value>
                  <description>DMA channel 1 transfer select 25:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_26</name>
                  <value>26</value>
                  <description>DMA channel 1 transfer select 26:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_27</name>
                  <value>27</value>
                  <description>DMA channel 1 transfer select 27:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_28</name>
                  <value>28</value>
                  <description>DMA channel 1 transfer select 28:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_29</name>
                  <value>29</value>
                  <description>DMA channel 1 transfer select 29:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_30</name>
                  <value>30</value>
                  <description>DMA channel 1 transfer select 30: previous DMA channel DMA0IFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_31</name>
                  <value>31</value>
                  <description>DMA channel 1 transfer select 31: ext. Trigger (DMAE0)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
