MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>DMACTL1</name>
          <addressOffset>0x0502</addressOffset>
          <size>16</size>
          <description>DMA Module Control 1</description>
          <fields>
            <field>
              <name>DMA2TSEL</name>
              <description>[4:0] DMA channel 2 transfer select bit 0</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA2TSEL_0</name>
                  <value>0</value>
                  <description>DMA channel 2 transfer select 0:  DMA_REQ (sw)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_1</name>
                  <value>1</value>
                  <description>DMA channel 2 transfer select 1:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_2</name>
                  <value>2</value>
                  <description>DMA channel 2 transfer select 2:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_3</name>
                  <value>3</value>
                  <description>DMA channel 2 transfer select 3:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_4</name>
                  <value>4</value>
                  <description>DMA channel 2 transfer select 4:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_5</name>
                  <value>5</value>
                  <description>DMA channel 2 transfer select 5:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_6</name>
                  <value>6</value>
                  <description>DMA channel 2 transfer select 6:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_7</name>
                  <value>7</value>
                  <description>DMA channel 2 transfer select 7:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_8</name>
                  <value>8</value>
                  <description>DMA channel 2 transfer select 8:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_9</name>
                  <value>9</value>
                  <description>DMA channel 2 transfer select 9:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_10</name>
                  <value>10</value>
                  <description>DMA channel 2 transfer select 10:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_11</name>
                  <value>11</value>
                  <description>DMA channel 2 transfer select 11:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_12</name>
                  <value>12</value>
                  <description>DMA channel 2 transfer select 12:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_13</name>
                  <value>13</value>
                  <description>DMA channel 2 transfer select 13:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_14</name>
                  <value>14</value>
                  <description>DMA channel 2 transfer select 14:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_15</name>
                  <value>15</value>
                  <description>DMA channel 2 transfer select 15:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_16</name>
                  <value>16</value>
                  <description>DMA channel 2 transfer select 16:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_17</name>
                  <value>17</value>
                  <description>DMA channel 2 transfer select 17:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_18</name>
                  <value>18</value>
                  <description>DMA channel 2 transfer select 18:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_19</name>
                  <value>19</value>
                  <description>DMA channel 2 transfer select 19:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_20</name>
                  <value>20</value>
                  <description>DMA channel 2 transfer select 20:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_21</name>
                  <value>21</value>
                  <description>DMA channel 2 transfer select 21:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_22</name>
                  <value>22</value>
                  <description>DMA channel 2 transfer select 22:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_23</name>
                  <value>23</value>
                  <description>DMA channel 2 transfer select 23:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_24</name>
                  <value>24</value>
                  <description>DMA channel 2 transfer select 24:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_25</name>
                  <value>25</value>
                  <description>DMA channel 2 transfer select 25:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_26</name>
                  <value>26</value>
                  <description>DMA channel 2 transfer select 26:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_27</name>
                  <value>27</value>
                  <description>DMA channel 2 transfer select 27:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_28</name>
                  <value>28</value>
                  <description>DMA channel 2 transfer select 28:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_29</name>
                  <value>29</value>
                  <description>DMA channel 2 transfer select 29:</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_30</name>
                  <value>30</value>
                  <description>DMA channel 2 transfer select 30: previous DMA channel DMA1IFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_31</name>
                  <value>31</value>
                  <description>DMA channel 2 transfer select 31: ext. Trigger (DMAE0)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACTL2</name>
          <addressOffset>0x0504</addressOffset>
          <size>16</size>
          <description>DMA Module Control 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMACTL3</name>
          <addressOffset>0x0506</addressOffset>
          <size>16</size>
          <description>DMA Module Control 3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMACTL4</name>
          <addressOffset>0x0508</addressOffset>
          <size>16</size>
          <description>DMA Module Control 4</description>
          <fields>
            <field>
              <name>ENNMI</name>
              <description>[0:0] Enable NMI interruption of DMA</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>ROUNDROBIN</name>
              <description>[1:1] Round-Robin DMA channel priorities</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DMARMWDIS</name>
              <description>[2:2] Inhibited DMA transfers during read-modify-write CPU operations</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMAIV</name>
          <addressOffset>0x050E</addressOffset>
          <size>16</size>
          <description>DMA Interrupt Vector Word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA0CTL</name>
          <addressOffset>0x0510</addressOffset>
          <size>16</size>
          <description>DMA Channel 0 Control</description>
          <fields>
            <field>
              <name>DMAREQ</name>
              <description>[0:0] Initiate DMA transfer with DMATSEL</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DMAABORT</name>
              <description>[1:1] DMA transfer aborted by NMI</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DMAIE</name>
              <description>[2:2] DMA interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DMAIFG</name>
              <description>[3:3] DMA interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DMAEN</name>
              <description>[4:4] DMA enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DMALEVEL</name>
              <description>[5:5] DMA level sensitive trigger select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DMASRCBYTE</name>
              <description>[6:6] DMA source byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DMADSTBYTE</name>
              <description>[7:7] DMA destination byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DMASRCINCR</name>
              <description>[9:8] DMA source increment bit 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASRCINCR_0</name>
                  <value>0</value>
                  <description>DMA source increment 0: source address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_1</name>
                  <value>1</value>
                  <description>DMA source increment 1: source address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_2</name>
                  <value>2</value>
                  <description>DMA source increment 2: source address decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_3</name>
                  <value>3</value>
                  <description>DMA source increment 3: source address incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTINCR</name>
              <description>[11:10] DMA destination increment bit 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADSTINCR_0</name>
                  <value>0</value>
                  <description>DMA destination increment 0: destination address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_1</name>
                  <value>1</value>
                  <description>DMA destination increment 1: destination address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_2</name>
                  <value>2</value>
                  <description>DMA destination increment 2: destination address decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_3</name>
                  <value>3</value>
                  <description>DMA destination increment 3: destination address incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADT</name>
              <description>[14:12] DMA transfer mode bit 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADT_0</name>
                  <value>0</value>
                  <description>DMA transfer mode 0: Single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_1</name>
                  <value>1</value>
                  <description>DMA transfer mode 1: Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_2</name>
                  <value>2</value>
                  <description>DMA transfer mode 2: Burst-Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_3</name>
                  <value>3</value>
                  <description>DMA transfer mode 3: Burst-Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_4</name>
                  <value>4</value>
                  <description>DMA transfer mode 4: Repeated Single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_5</name>
                  <value>5</value>
                  <description>DMA transfer mode 5: Repeated Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_6</name>
                  <value>6</value>
                  <description>DMA transfer mode 6: Repeated Burst-Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_7</name>
                  <value>7</value>
                  <description>DMA transfer mode 7: Repeated Burst-Block transfer</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMA0SA</name>
          <addressOffset>0x0512</addressOffset>
          <size>32</size>
          <description>DMA Channel 0 Source Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA0DA</name>
          <addressOffset>0x0516</addressOffset>
          <size>32</size>
          <description>DMA Channel 0 Destination Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA0SZ</name>
          <addressOffset>0x051A</addressOffset>
          <size>16</size>
          <description>DMA Channel 0 Transfer Size</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA1CTL</name>
          <addressOffset>0x0520</addressOffset>
          <size>16</size>
          <description>DMA Channel 1 Control</description>
          <fields>
            <field>
              <name>DMAREQ</name>
              <description>[0:0] Initiate DMA transfer with DMATSEL</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DMAABORT</name>
              <description>[1:1] DMA transfer aborted by NMI</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DMAIE</name>
              <description>[2:2] DMA interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DMAIFG</name>
              <description>[3:3] DMA interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DMAEN</name>
              <description>[4:4] DMA enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DMALEVEL</name>
              <description>[5:5] DMA level sensitive trigger select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DMASRCBYTE</name>
              <description>[6:6] DMA source byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DMADSTBYTE</name>
              <description>[7:7] DMA destination byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DMASRCINCR</name>
              <description>[9:8] DMA source increment bit 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASRCINCR_0</name>
                  <value>0</value>
                  <description>DMA source increment 0: source address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_1</name>
                  <value>1</value>
                  <description>DMA source increment 1: source address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_2</name>
                  <value>2</value>
                  <description>DMA source increment 2: source address decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_3</name>
                  <value>3</value>
                  <description>DMA source increment 3: source address incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTINCR</name>
              <description>[11:10] DMA destination increment bit 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADSTINCR_0</name>
                  <value>0</value>
                  <description>DMA destination increment 0: destination address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_1</name>
                  <value>1</value>
                  <description>DMA destination increment 1: destination address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_2</name>
                  <value>2</value>
                  <description>DMA destination increment 2: destination address decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_3</name>
                  <value>3</value>
                  <description>DMA destination increment 3: destination address incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADT</name>
              <description>[14:12] DMA transfer mode bit 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADT_0</name>
                  <value>0</value>
                  <description>DMA transfer mode 0: Single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_1</name>
                  <value>1</value>
                  <description>DMA transfer mode 1: Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_2</name>
                  <value>2</value>
                  <description>DMA transfer mode 2: Burst-Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_3</name>
                  <value>3</value>
                  <description>DMA transfer mode 3: Burst-Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_4</name>
                  <value>4</value>
                  <description>DMA transfer mode 4: Repeated Single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_5</name>
                  <value>5</value>
                  <description>DMA transfer mode 5: Repeated Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_6</name>
                  <value>6</value>
                  <description>DMA transfer mode 6: Repeated Burst-Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_7</name>
                  <value>7</value>
                  <description>DMA transfer mode 7: Repeated Burst-Block transfer</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
