MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>DMA1SA</name>
          <addressOffset>0x0522</addressOffset>
          <size>32</size>
          <description>DMA Channel 1 Source Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA1DA</name>
          <addressOffset>0x0526</addressOffset>
          <size>32</size>
          <description>DMA Channel 1 Destination Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA1SZ</name>
          <addressOffset>0x052A</addressOffset>
          <size>16</size>
          <description>DMA Channel 1 Transfer Size</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA2CTL</name>
          <addressOffset>0x0530</addressOffset>
          <size>16</size>
          <description>DMA Channel 2 Control</description>
          <fields>
            <field>
              <name>DMAREQ</name>
              <description>[0:0] Initiate DMA transfer with DMATSEL</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DMAABORT</name>
              <description>[1:1] DMA transfer aborted by NMI</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DMAIE</name>
              <description>[2:2] DMA interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DMAIFG</name>
              <description>[3:3] DMA interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DMAEN</name>
              <description>[4:4] DMA enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DMALEVEL</name>
              <description>[5:5] DMA level sensitive trigger select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DMASRCBYTE</name>
              <description>[6:6] DMA source byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DMADSTBYTE</name>
              <description>[7:7] DMA destination byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DMASRCINCR</name>
              <description>[9:8] DMA source increment bit 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASRCINCR_0</name>
                  <value>0</value>
                  <description>DMA source increment 0: source address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_1</name>
                  <value>1</value>
                  <description>DMA source increment 1: source address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_2</name>
                  <value>2</value>
                  <description>DMA source increment 2: source address decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_3</name>
                  <value>3</value>
                  <description>DMA source increment 3: source address incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTINCR</name>
              <description>[11:10] DMA destination increment bit 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADSTINCR_0</name>
                  <value>0</value>
                  <description>DMA destination increment 0: destination address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_1</name>
                  <value>1</value>
                  <description>DMA destination increment 1: destination address unchanged</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_2</name>
                  <value>2</value>
                  <description>DMA destination increment 2: destination address decremented</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_3</name>
                  <value>3</value>
                  <description>DMA destination increment 3: destination address incremented</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADT</name>
              <description>[14:12] DMA transfer mode bit 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADT_0</name>
                  <value>0</value>
                  <description>DMA transfer mode 0: Single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_1</name>
                  <value>1</value>
                  <description>DMA transfer mode 1: Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_2</name>
                  <value>2</value>
                  <description>DMA transfer mode 2: Burst-Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_3</name>
                  <value>3</value>
                  <description>DMA transfer mode 3: Burst-Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_4</name>
                  <value>4</value>
                  <description>DMA transfer mode 4: Repeated Single transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_5</name>
                  <value>5</value>
                  <description>DMA transfer mode 5: Repeated Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_6</name>
                  <value>6</value>
                  <description>DMA transfer mode 6: Repeated Burst-Block transfer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_7</name>
                  <value>7</value>
                  <description>DMA transfer mode 7: Repeated Burst-Block transfer</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMA2SA</name>
          <addressOffset>0x0532</addressOffset>
          <size>32</size>
          <description>DMA Channel 2 Source Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA2DA</name>
          <addressOffset>0x0536</addressOffset>
          <size>32</size>
          <description>DMA Channel 2 Destination Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA2SZ</name>
          <addressOffset>0x053A</addressOffset>
          <size>16</size>
          <description>DMA Channel 2 Transfer Size</description>
          <resetValue>0</resetValue>
        </register>
