MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FRAM</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>FRAM</description>
      <registers>
        <register>
          <name>FRCTL0</name>
          <addressOffset>0x0140</addressOffset>
          <size>16</size>
          <description>FRAM Controller Control 0</description>
          <fields>
            <field>
              <name>NPRECHG</name>
              <description>[2:0] FRAM Wait state Generator Precharge Time control Bit: 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NPRECHG_0</name>
                  <value>0</value>
                  <description>FRAM Wait state Generator Precharge Time control: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPRECHG_1</name>
                  <value>1</value>
                  <description>FRAM Wait state Generator Precharge Time control: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPRECHG_2</name>
                  <value>2</value>
                  <description>FRAM Wait state Generator Precharge Time control: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPRECHG_3</name>
                  <value>3</value>
                  <description>FRAM Wait state Generator Precharge Time control: 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPRECHG_4</name>
                  <value>4</value>
                  <description>FRAM Wait state Generator Precharge Time control: 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPRECHG_5</name>
                  <value>5</value>
                  <description>FRAM Wait state Generator Precharge Time control: 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPRECHG_6</name>
                  <value>6</value>
                  <description>FRAM Wait state Generator Precharge Time control: 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPRECHG_7</name>
                  <value>7</value>
                  <description>FRAM Wait state Generator Precharge Time control: 7</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAUTO</name>
              <description>[3:3] FRAM Disables the wait state generator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>NACCESS</name>
              <description>[6:4] FRAM Wait state Generator Access Time control Bit: 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NACCESS_0</name>
                  <value>0</value>
                  <description>FRAM Wait state Generator Access Time control: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACCESS_1</name>
                  <value>1</value>
                  <description>FRAM Wait state Generator Access Time control: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACCESS_2</name>
                  <value>2</value>
                  <description>FRAM Wait state Generator Access Time control: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACCESS_3</name>
                  <value>3</value>
                  <description>FRAM Wait state Generator Access Time control: 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACCESS_4</name>
                  <value>4</value>
                  <description>FRAM Wait state Generator Access Time control: 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACCESS_5</name>
                  <value>5</value>
                  <description>FRAM Wait state Generator Access Time control: 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACCESS_6</name>
                  <value>6</value>
                  <description>FRAM Wait state Generator Access Time control: 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACCESS_7</name>
                  <value>7</value>
                  <description>FRAM Wait state Generator Access Time control: 7</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GCCTL0</name>
          <addressOffset>0x0144</addressOffset>
          <size>16</size>
          <description>General Control 0</description>
          <fields>
            <field>
              <name>BUSY</name>
              <description>[0:0] FRAM is currently busy programming</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>ACCTEIE</name>
              <description>[3:3] Enable NMI event if Access time error occurs</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>ACCVIE</name>
              <description>[4:4] Enable NMI event if Access Violation occurs</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CBDIE</name>
              <description>[5:5] Enable NMI event if correctable bit error detected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UBDIE</name>
              <description>[6:6] Enable NMI event if uncorrectable bit error detected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UBDRSTEN</name>
              <description>[7:7] Enable Power Up Clear on uncorrectable bit error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GCCTL1</name>
          <addressOffset>0x0146</addressOffset>
          <size>16</size>
          <description>General Control 1</description>
          <fields>
            <field>
              <name>ACCVIFG</name>
              <description>[0:0] Access Violation Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>CBDIFG</name>
              <description>[1:1] FRAM correctable bit error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UBDIFG</name>
              <description>[2:2] FRAM uncorrectable bit error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ACCTEIFG</name>
              <description>[3:3] Access time error flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
