MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPU</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>MPU</description>
      <registers>
        <register>
          <name>MPUCTL0</name>
          <addressOffset>0x05A0</addressOffset>
          <size>16</size>
          <description>MPU Control Register 0</description>
          <fields>
            <field>
              <name>MPUENA</name>
              <description>[0:0] MPU Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPUCTL1</name>
          <addressOffset>0x05A2</addressOffset>
          <size>16</size>
          <description>MPU Control Register 1</description>
          <fields>
            <field>
              <name>MPUSEG1IFG</name>
              <description>[0:0] MPU Main Memory Segment 1 violation interupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MPUSEG2IFG</name>
              <description>[1:1] MPU Main Memory Segment 2 violation interupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MPUSEG3IFG</name>
              <description>[2:2] MPU Main Memory Segment 3 violation interupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MPUSEGIIFG</name>
              <description>[3:3] MPU Info Memory Segment violation interupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPUSEG</name>
          <addressOffset>0x05A4</addressOffset>
          <size>16</size>
          <description>MPU Segmentation Register</description>
          <fields>
            <field>
              <name>MPUSB10</name>
              <description>[0:0] MPU Segment Border 1 Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MPUSB11</name>
              <description>[1:1] MPU Segment Border 1 Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MPUSB12</name>
              <description>[2:2] MPU Segment Border 1 Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MPUSB13</name>
              <description>[3:3] MPU Segment Border 1 Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MPUSB14</name>
              <description>[4:4] MPU Segment Border 1 Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MPUSB20</name>
              <description>[8:8] MPU Segment Border 2 Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MPUSB21</name>
              <description>[9:9] MPU Segment Border 2 Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>MPUSB22</name>
              <description>[10:10] MPU Segment Border 2 Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MPUSB23</name>
              <description>[11:11] MPU Segment Border 2 Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MPUSB24</name>
              <description>[12:12] MPU Segment Border 2 Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPUSAM</name>
          <addressOffset>0x05A6</addressOffset>
          <size>16</size>
          <description>MPU Access Management Register</description>
          <fields>
            <field>
              <name>MPUSEG1RE</name>
              <description>[0:0] MPU Main memory Segment 1 Read enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MPUSEG1WE</name>
              <description>[1:1] MPU Main memory Segment 1 Write enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MPUSEG1XE</name>
              <description>[2:2] MPU Main memory Segment 1 Execute enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MPUSEG1VS</name>
              <description>[3:3] MPU Main memory Segment 1 Violation select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MPUSEG2RE</name>
              <description>[4:4] MPU Main memory Segment 2 Read enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MPUSEG2WE</name>
              <description>[5:5] MPU Main memory Segment 2 Write enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MPUSEG2XE</name>
              <description>[6:6] MPU Main memory Segment 2 Execute enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MPUSEG2VS</name>
              <description>[7:7] MPU Main memory Segment 2 Violation select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>MPUSEG3RE</name>
              <description>[8:8] MPU Main memory Segment 3 Read enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MPUSEG3WE</name>
              <description>[9:9] MPU Main memory Segment 3 Write enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>MPUSEG3XE</name>
              <description>[10:10] MPU Main memory Segment 3 Execute enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MPUSEG3VS</name>
              <description>[11:11] MPU Main memory Segment 3 Violation select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MPUSEGIRE</name>
              <description>[12:12] MPU Info memory Segment Read enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MPUSEGIWE</name>
              <description>[13:13] MPU Info memory Segment Write enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>MPUSEGIXE</name>
              <description>[14:14] MPU Info memory Segment Execute enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>MPUSEGIVS</name>
              <description>[15:15] MPU Info memory Segment Violation select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
