MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPY_16__Multiplier__16_Bit_Mode</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>MPY 16  Multiplier  16 Bit Mode</description>
      <registers>
        <register>
          <name>MPY</name>
          <addressOffset>0x04C0</addressOffset>
          <size>16</size>
          <description>Multiply Unsigned/Operand 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPYS</name>
          <addressOffset>0x04C2</addressOffset>
          <size>16</size>
          <description>Multiply Signed/Operand 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MAC</name>
          <addressOffset>0x04C4</addressOffset>
          <size>16</size>
          <description>Multiply Unsigned and Accumulate/Operand 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MACS</name>
          <addressOffset>0x04C6</addressOffset>
          <size>16</size>
          <description>Multiply Signed and Accumulate/Operand 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OP2</name>
          <addressOffset>0x04C8</addressOffset>
          <size>16</size>
          <description>Operand 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RESLO</name>
          <addressOffset>0x04CA</addressOffset>
          <size>16</size>
          <description>Result Low Word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RESHI</name>
          <addressOffset>0x04CC</addressOffset>
          <size>16</size>
          <description>Result High Word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SUMEXT</name>
          <addressOffset>0x04CE</addressOffset>
          <size>16</size>
          <description>Sum Extend</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPY32CTL0</name>
          <addressOffset>0x04EC</addressOffset>
          <size>16</size>
          <description>MPY32 Control Register 0</description>
          <fields>
            <field>
              <name>MPYC</name>
              <description>[0:0] Carry of the multiplier</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MPYFRAC</name>
              <description>[2:2] Fractional mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MPYSAT</name>
              <description>[3:3] Saturation mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MPYM</name>
              <description>[5:4] Multiplier mode Bit:0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPYM_0</name>
                  <value>0</value>
                  <description>Multiplier mode: MPY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYM_1</name>
                  <value>1</value>
                  <description>Multiplier mode: MPYS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYM_2</name>
                  <value>2</value>
                  <description>Multiplier mode: MAC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYM_3</name>
                  <value>3</value>
                  <description>Multiplier mode: MACS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OP1_32</name>
              <description>[6:6] Bit-width of operand 1 0:16Bit / 1:32Bit</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>OP2_32</name>
              <description>[7:7] Bit-width of operand 2 0:16Bit / 1:32Bit</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>MPYDLYWRTEN</name>
              <description>[8:8] Delayed write enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MPYDLY32</name>
              <description>[9:9] Delayed write mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MPY_32__Multiplier__32_Bit_Mode</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>MPY 32  Multiplier  32 Bit Mode</description>
      <registers>
        <register>
          <name>MPY32L</name>
          <addressOffset>0x04D0</addressOffset>
          <size>16</size>
          <description>32-bit operand 1 - multiply - low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPY32H</name>
          <addressOffset>0x04D2</addressOffset>
          <size>16</size>
          <description>32-bit operand 1 - multiply - high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPYS32L</name>
          <addressOffset>0x04D4</addressOffset>
          <size>16</size>
          <description>32-bit operand 1 - signed multiply - low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPYS32H</name>
          <addressOffset>0x04D6</addressOffset>
          <size>16</size>
          <description>32-bit operand 1 - signed multiply - high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MAC32L</name>
          <addressOffset>0x04D8</addressOffset>
          <size>16</size>
          <description>32-bit operand 1 - multiply accumulate - low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MAC32H</name>
          <addressOffset>0x04DA</addressOffset>
          <size>16</size>
          <description>32-bit operand 1 - multiply accumulate - high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MACS32L</name>
          <addressOffset>0x04DC</addressOffset>
          <size>16</size>
          <description>32-bit operand 1 - signed multiply accumulate - low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MACS32H</name>
          <addressOffset>0x04DE</addressOffset>
          <size>16</size>
          <description>32-bit operand 1 - signed multiply accumulate - high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OP2L</name>
          <addressOffset>0x04E0</addressOffset>
          <size>16</size>
          <description>32-bit operand 2 - low word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OP2H</name>
          <addressOffset>0x04E2</addressOffset>
          <size>16</size>
          <description>32-bit operand 2 - high word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RES0</name>
          <addressOffset>0x04E4</addressOffset>
          <size>16</size>
          <description>32x32-bit result 0 - least significant word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RES1</name>
          <addressOffset>0x04E6</addressOffset>
          <size>16</size>
          <description>32x32-bit result 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RES2</name>
          <addressOffset>0x04E8</addressOffset>
          <size>16</size>
          <description>32x32-bit result 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RES3</name>
          <addressOffset>0x04EA</addressOffset>
          <size>16</size>
          <description>32x32-bit result 3 - most significant word</description>
          <resetValue>0</resetValue>
        </register>
