MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMM__Power_Management_System</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>PMM  Power Management System</description>
      <registers>
        <register>
          <name>PMMCTL0</name>
          <addressOffset>0x0120</addressOffset>
          <size>16</size>
          <description>PMM Control 0</description>
          <fields>
            <field>
              <name>PMMSWBOR</name>
              <description>[2:2] PMM Software BOR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PMMSWPOR</name>
              <description>[3:3] PMM Software POR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PMMREGOFF</name>
              <description>[4:4] PMM Turn Regulator off</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SVSLE</name>
              <description>[5:5] SVS low side enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>SVSHE</name>
              <description>[6:6] SVS high side enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PMMIFG</name>
          <addressOffset>0x012A</addressOffset>
          <size>16</size>
          <description>PMM Interrupt Flag</description>
          <fields>
            <field>
              <name>PMMBORIFG</name>
              <description>[8:8] PMM Software BOR interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PMMRSTIFG</name>
              <description>[9:9] PMM RESET pin interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PMMPORIFG</name>
              <description>[10:10] PMM Software POR interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SVSLIFG</name>
              <description>[12:12] SVS high side interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>SVSHIFG</name>
              <description>[13:13] SVS low side interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PMMLPM5IFG</name>
              <description>[15:15] LPM5 indication Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PM5CTL0</name>
          <addressOffset>0x0130</addressOffset>
          <size>16</size>
          <description>PMM Power Mode 5 Control Register 0</description>
          <fields>
            <field>
              <name>LOCKLPM5</name>
              <description>[0:0] Lock I/O pin configuration upon entry/exit to/from LPM5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>Port_A</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Port A</description>
      <registers>
        <register>
          <name>PAIN</name>
          <addressOffset>0x0200</addressOffset>
          <size>16</size>
          <description>Port A Input</description>
          <fields>
            <field>
              <name>PAIN0</name>
              <description>[0:0] PAIN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PAIN1</name>
              <description>[1:1] PAIN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PAIN2</name>
              <description>[2:2] PAIN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PAIN3</name>
              <description>[3:3] PAIN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PAIN4</name>
              <description>[4:4] PAIN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PAIN5</name>
              <description>[5:5] PAIN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PAIN6</name>
              <description>[6:6] PAIN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PAIN7</name>
              <description>[7:7] PAIN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PAIN8</name>
              <description>[8:8] PAIN8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAIN9</name>
              <description>[9:9] PAIN9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PAIN10</name>
              <description>[10:10] PAIN10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PAIN11</name>
              <description>[11:11] PAIN11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PAIN12</name>
              <description>[12:12] PAIN12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PAIN13</name>
              <description>[13:13] PAIN13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PAIN14</name>
              <description>[14:14] PAIN14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PAIN15</name>
              <description>[15:15] PAIN15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PAOUT</name>
          <addressOffset>0x0202</addressOffset>
          <size>16</size>
          <description>Port A Output</description>
          <fields>
            <field>
              <name>PAOUT0</name>
              <description>[0:0] PAOUT0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PAOUT1</name>
              <description>[1:1] PAOUT1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PAOUT2</name>
              <description>[2:2] PAOUT2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PAOUT3</name>
              <description>[3:3] PAOUT3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PAOUT4</name>
              <description>[4:4] PAOUT4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PAOUT5</name>
              <description>[5:5] PAOUT5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PAOUT6</name>
              <description>[6:6] PAOUT6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PAOUT7</name>
              <description>[7:7] PAOUT7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PAOUT8</name>
              <description>[8:8] PAOUT8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAOUT9</name>
              <description>[9:9] PAOUT9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PAOUT10</name>
              <description>[10:10] PAOUT10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PAOUT11</name>
              <description>[11:11] PAOUT11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PAOUT12</name>
              <description>[12:12] PAOUT12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PAOUT13</name>
              <description>[13:13] PAOUT13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PAOUT14</name>
              <description>[14:14] PAOUT14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PAOUT15</name>
              <description>[15:15] PAOUT15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PADIR</name>
          <addressOffset>0x0204</addressOffset>
          <size>16</size>
          <description>Port A Direction</description>
          <fields>
            <field>
              <name>PADIR0</name>
              <description>[0:0] PADIR0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PADIR1</name>
              <description>[1:1] PADIR1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PADIR2</name>
              <description>[2:2] PADIR2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PADIR3</name>
              <description>[3:3] PADIR3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PADIR4</name>
              <description>[4:4] PADIR4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PADIR5</name>
              <description>[5:5] PADIR5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PADIR6</name>
              <description>[6:6] PADIR6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PADIR7</name>
              <description>[7:7] PADIR7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PADIR8</name>
              <description>[8:8] PADIR8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PADIR9</name>
              <description>[9:9] PADIR9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PADIR10</name>
              <description>[10:10] PADIR10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PADIR11</name>
              <description>[11:11] PADIR11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PADIR12</name>
              <description>[12:12] PADIR12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PADIR13</name>
              <description>[13:13] PADIR13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PADIR14</name>
              <description>[14:14] PADIR14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PADIR15</name>
              <description>[15:15] PADIR15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PAREN</name>
          <addressOffset>0x0206</addressOffset>
          <size>16</size>
          <description>Port A Resistor Enable</description>
          <fields>
            <field>
              <name>PAREN0</name>
              <description>[0:0] PAREN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PAREN1</name>
              <description>[1:1] PAREN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PAREN2</name>
              <description>[2:2] PAREN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PAREN3</name>
              <description>[3:3] PAREN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PAREN4</name>
              <description>[4:4] PAREN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PAREN5</name>
              <description>[5:5] PAREN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PAREN6</name>
              <description>[6:6] PAREN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PAREN7</name>
              <description>[7:7] PAREN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PAREN8</name>
              <description>[8:8] PAREN8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAREN9</name>
              <description>[9:9] PAREN9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PAREN10</name>
              <description>[10:10] PAREN10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PAREN11</name>
              <description>[11:11] PAREN11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PAREN12</name>
              <description>[12:12] PAREN12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PAREN13</name>
              <description>[13:13] PAREN13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PAREN14</name>
              <description>[14:14] PAREN14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PAREN15</name>
              <description>[15:15] PAREN15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PASEL0</name>
          <addressOffset>0x020A</addressOffset>
          <size>16</size>
          <description>Port A Selection 0</description>
          <fields>
            <field>
              <name>PASEL0_0</name>
              <description>[0:0] PASEL0_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PASEL0_1</name>
              <description>[1:1] PASEL0_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PASEL0_2</name>
              <description>[2:2] PASEL0_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PASEL0_3</name>
              <description>[3:3] PASEL0_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PASEL0_4</name>
              <description>[4:4] PASEL0_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PASEL0_5</name>
              <description>[5:5] PASEL0_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PASEL0_6</name>
              <description>[6:6] PASEL0_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PASEL0_7</name>
              <description>[7:7] PASEL0_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PASEL0_8</name>
              <description>[8:8] PASEL0_8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PASEL0_9</name>
              <description>[9:9] PASEL0_9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PASEL0_10</name>
              <description>[10:10] PASEL0_10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PASEL0_11</name>
              <description>[11:11] PASEL0_11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PASEL0_12</name>
              <description>[12:12] PASEL0_12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PASEL0_13</name>
              <description>[13:13] PASEL0_13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PASEL0_14</name>
              <description>[14:14] PASEL0_14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PASEL0_15</name>
              <description>[15:15] PASEL0_15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
