MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>PASEL1</name>
          <addressOffset>0x020C</addressOffset>
          <size>16</size>
          <description>Port A Selection 1</description>
          <fields>
            <field>
              <name>PASEL1_0</name>
              <description>[0:0] PASEL1_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PASEL1_1</name>
              <description>[1:1] PASEL1_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PASEL1_2</name>
              <description>[2:2] PASEL1_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PASEL1_3</name>
              <description>[3:3] PASEL1_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PASEL1_4</name>
              <description>[4:4] PASEL1_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PASEL1_5</name>
              <description>[5:5] PASEL1_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PASEL1_6</name>
              <description>[6:6] PASEL1_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PASEL1_7</name>
              <description>[7:7] PASEL1_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PASEL1_8</name>
              <description>[8:8] PASEL1_8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PASEL1_9</name>
              <description>[9:9] PASEL1_9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PASEL1_10</name>
              <description>[10:10] PASEL1_10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PASEL1_11</name>
              <description>[11:11] PASEL1_11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PASEL1_12</name>
              <description>[12:12] PASEL1_12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PASEL1_13</name>
              <description>[13:13] PASEL1_13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PASEL1_14</name>
              <description>[14:14] PASEL1_14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PASEL1_15</name>
              <description>[15:15] PASEL1_15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PASELC</name>
          <addressOffset>0x0216</addressOffset>
          <size>16</size>
          <description>Port A Complement Selection</description>
          <fields>
            <field>
              <name>PASELC_0</name>
              <description>[0:0] PASELC_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PASELC_1</name>
              <description>[1:1] PASELC_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PASELC_2</name>
              <description>[2:2] PASELC_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PASELC_3</name>
              <description>[3:3] PASELC_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PASELC_4</name>
              <description>[4:4] PASELC_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PASELC_5</name>
              <description>[5:5] PASELC_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PASELC_6</name>
              <description>[6:6] PASELC_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PASELC_7</name>
              <description>[7:7] PASELC_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PASELC_8</name>
              <description>[8:8] PASELC_8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PASELC_9</name>
              <description>[9:9] PASELC_9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PASELC_10</name>
              <description>[10:10] PASELC_10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PASELC_11</name>
              <description>[11:11] PASELC_11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PASELC_12</name>
              <description>[12:12] PASELC_12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PASELC_13</name>
              <description>[13:13] PASELC_13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PASELC_14</name>
              <description>[14:14] PASELC_14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PASELC_15</name>
              <description>[15:15] PASELC_15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PAIES</name>
          <addressOffset>0x0218</addressOffset>
          <size>16</size>
          <description>Port A Interrupt Edge Select</description>
          <fields>
            <field>
              <name>PAIES0</name>
              <description>[0:0] PAIES0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PAIES1</name>
              <description>[1:1] PAIES1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PAIES2</name>
              <description>[2:2] PAIES2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PAIES3</name>
              <description>[3:3] PAIES3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PAIES4</name>
              <description>[4:4] PAIES4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PAIES5</name>
              <description>[5:5] PAIES5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PAIES6</name>
              <description>[6:6] PAIES6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PAIES7</name>
              <description>[7:7] PAIES7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PAIES8</name>
              <description>[8:8] PAIES8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAIES9</name>
              <description>[9:9] PAIES9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PAIES10</name>
              <description>[10:10] PAIES10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PAIES11</name>
              <description>[11:11] PAIES11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PAIES12</name>
              <description>[12:12] PAIES12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PAIES13</name>
              <description>[13:13] PAIES13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PAIES14</name>
              <description>[14:14] PAIES14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PAIES15</name>
              <description>[15:15] PAIES15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PAIE</name>
          <addressOffset>0x021A</addressOffset>
          <size>16</size>
          <description>Port A Interrupt Enable</description>
          <fields>
            <field>
              <name>PAIE0</name>
              <description>[0:0] PAIE0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PAIE1</name>
              <description>[1:1] PAIE1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PAIE2</name>
              <description>[2:2] PAIE2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PAIE3</name>
              <description>[3:3] PAIE3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PAIE4</name>
              <description>[4:4] PAIE4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PAIE5</name>
              <description>[5:5] PAIE5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PAIE6</name>
              <description>[6:6] PAIE6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PAIE7</name>
              <description>[7:7] PAIE7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PAIE8</name>
              <description>[8:8] PAIE8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAIE9</name>
              <description>[9:9] PAIE9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PAIE10</name>
              <description>[10:10] PAIE10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PAIE11</name>
              <description>[11:11] PAIE11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PAIE12</name>
              <description>[12:12] PAIE12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PAIE13</name>
              <description>[13:13] PAIE13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PAIE14</name>
              <description>[14:14] PAIE14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PAIE15</name>
              <description>[15:15] PAIE15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PAIFG</name>
          <addressOffset>0x021C</addressOffset>
          <size>16</size>
          <description>Port A Interrupt Flag</description>
          <fields>
            <field>
              <name>PAIFG0</name>
              <description>[0:0] PAIFG0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PAIFG1</name>
              <description>[1:1] PAIFG1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PAIFG2</name>
              <description>[2:2] PAIFG2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PAIFG3</name>
              <description>[3:3] PAIFG3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PAIFG4</name>
              <description>[4:4] PAIFG4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PAIFG5</name>
              <description>[5:5] PAIFG5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PAIFG6</name>
              <description>[6:6] PAIFG6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PAIFG7</name>
              <description>[7:7] PAIFG7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PAIFG8</name>
              <description>[8:8] PAIFG8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAIFG9</name>
              <description>[9:9] PAIFG9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PAIFG10</name>
              <description>[10:10] PAIFG10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PAIFG11</name>
              <description>[11:11] PAIFG11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PAIFG12</name>
              <description>[12:12] PAIFG12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PAIFG13</name>
              <description>[13:13] PAIFG13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PAIFG14</name>
              <description>[14:14] PAIFG14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PAIFG15</name>
              <description>[15:15] PAIFG15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
