MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Port_1_2</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Port 1/2</description>
      <registers>
        <register>
          <name>P1IN</name>
          <addressOffset>0x0200</addressOffset>
          <size>8</size>
          <description>Port 1 Input</description>
          <fields>
            <field>
              <name>P1IN0</name>
              <description>[0:0] P1IN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1IN1</name>
              <description>[1:1] P1IN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1IN2</name>
              <description>[2:2] P1IN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1IN3</name>
              <description>[3:3] P1IN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1IN4</name>
              <description>[4:4] P1IN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1IN5</name>
              <description>[5:5] P1IN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1IN6</name>
              <description>[6:6] P1IN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1IN7</name>
              <description>[7:7] P1IN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P1OUT</name>
          <addressOffset>0x0202</addressOffset>
          <size>8</size>
          <description>Port 1 Output</description>
          <fields>
            <field>
              <name>P1OUT0</name>
              <description>[0:0] P1OUT0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1OUT1</name>
              <description>[1:1] P1OUT1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1OUT2</name>
              <description>[2:2] P1OUT2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1OUT3</name>
              <description>[3:3] P1OUT3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1OUT4</name>
              <description>[4:4] P1OUT4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1OUT5</name>
              <description>[5:5] P1OUT5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1OUT6</name>
              <description>[6:6] P1OUT6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1OUT7</name>
              <description>[7:7] P1OUT7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P1DIR</name>
          <addressOffset>0x0204</addressOffset>
          <size>8</size>
          <description>Port 1 Direction</description>
          <fields>
            <field>
              <name>P1DIR0</name>
              <description>[0:0] P1DIR0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1DIR1</name>
              <description>[1:1] P1DIR1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1DIR2</name>
              <description>[2:2] P1DIR2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1DIR3</name>
              <description>[3:3] P1DIR3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1DIR4</name>
              <description>[4:4] P1DIR4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1DIR5</name>
              <description>[5:5] P1DIR5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1DIR6</name>
              <description>[6:6] P1DIR6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1DIR7</name>
              <description>[7:7] P1DIR7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P1REN</name>
          <addressOffset>0x0206</addressOffset>
          <size>8</size>
          <description>Port 1 Resistor Enable</description>
          <fields>
            <field>
              <name>P1REN0</name>
              <description>[0:0] P1REN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1REN1</name>
              <description>[1:1] P1REN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1REN2</name>
              <description>[2:2] P1REN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1REN3</name>
              <description>[3:3] P1REN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1REN4</name>
              <description>[4:4] P1REN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1REN5</name>
              <description>[5:5] P1REN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1REN6</name>
              <description>[6:6] P1REN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1REN7</name>
              <description>[7:7] P1REN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P1SEL0</name>
          <addressOffset>0x020A</addressOffset>
          <size>8</size>
          <description>Port 1 Selection 0</description>
          <fields>
            <field>
              <name>P1SEL0_0</name>
              <description>[0:0] P1SEL0_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1SEL0_1</name>
              <description>[1:1] P1SEL0_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1SEL0_2</name>
              <description>[2:2] P1SEL0_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1SEL0_3</name>
              <description>[3:3] P1SEL0_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1SEL0_4</name>
              <description>[4:4] P1SEL0_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1SEL0_5</name>
              <description>[5:5] P1SEL0_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1SEL0_6</name>
              <description>[6:6] P1SEL0_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1SEL0_7</name>
              <description>[7:7] P1SEL0_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P1SEL1</name>
          <addressOffset>0x020C</addressOffset>
          <size>8</size>
          <description>Port 1 Selection 1</description>
          <fields>
            <field>
              <name>P1SEL1_0</name>
              <description>[0:0] P1SEL1_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1SEL1_1</name>
              <description>[1:1] P1SEL1_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1SEL1_2</name>
              <description>[2:2] P1SEL1_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1SEL1_3</name>
              <description>[3:3] P1SEL1_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1SEL1_4</name>
              <description>[4:4] P1SEL1_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1SEL1_5</name>
              <description>[5:5] P1SEL1_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1SEL1_6</name>
              <description>[6:6] P1SEL1_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1SEL1_7</name>
              <description>[7:7] P1SEL1_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P1SELC</name>
          <addressOffset>0x0216</addressOffset>
          <size>8</size>
          <description>Port 1 Complement Selection</description>
          <fields>
            <field>
              <name>P1SELC_0</name>
              <description>[0:0] P1SELC_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1SELC_1</name>
              <description>[1:1] P1SELC_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1SELC_2</name>
              <description>[2:2] P1SELC_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1SELC_3</name>
              <description>[3:3] P1SELC_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1SELC_4</name>
              <description>[4:4] P1SELC_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1SELC_5</name>
              <description>[5:5] P1SELC_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1SELC_6</name>
              <description>[6:6] P1SELC_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1SELC_7</name>
              <description>[7:7] P1SELC_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P1IV</name>
          <addressOffset>0x020E</addressOffset>
          <size>16</size>
          <description>Port 1 Interrupt Vector Word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P1IES</name>
          <addressOffset>0x0218</addressOffset>
          <size>8</size>
          <description>Port 1 Interrupt Edge Select</description>
          <fields>
            <field>
              <name>P1IES0</name>
              <description>[0:0] P1IES0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1IES1</name>
              <description>[1:1] P1IES1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1IES2</name>
              <description>[2:2] P1IES2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1IES3</name>
              <description>[3:3] P1IES3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1IES4</name>
              <description>[4:4] P1IES4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1IES5</name>
              <description>[5:5] P1IES5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1IES6</name>
              <description>[6:6] P1IES6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1IES7</name>
              <description>[7:7] P1IES7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P1IE</name>
          <addressOffset>0x021A</addressOffset>
          <size>8</size>
          <description>Port 1 Interrupt Enable</description>
          <fields>
            <field>
              <name>P1IE0</name>
              <description>[0:0] P1IE0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1IE1</name>
              <description>[1:1] P1IE1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1IE2</name>
              <description>[2:2] P1IE2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1IE3</name>
              <description>[3:3] P1IE3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1IE4</name>
              <description>[4:4] P1IE4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1IE5</name>
              <description>[5:5] P1IE5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1IE6</name>
              <description>[6:6] P1IE6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1IE7</name>
              <description>[7:7] P1IE7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P1IFG</name>
          <addressOffset>0x021C</addressOffset>
          <size>8</size>
          <description>Port 1 Interrupt Flag</description>
          <fields>
            <field>
              <name>P1IFG0</name>
              <description>[0:0] P1IFG0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P1IFG1</name>
              <description>[1:1] P1IFG1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P1IFG2</name>
              <description>[2:2] P1IFG2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P1IFG3</name>
              <description>[3:3] P1IFG3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P1IFG4</name>
              <description>[4:4] P1IFG4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P1IFG5</name>
              <description>[5:5] P1IFG5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P1IFG6</name>
              <description>[6:6] P1IFG6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P1IFG7</name>
              <description>[7:7] P1IFG7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P2IN</name>
          <addressOffset>0x0201</addressOffset>
          <size>8</size>
          <description>Port 2 Input</description>
          <fields>
            <field>
              <name>P2IN0</name>
              <description>[0:0] P2IN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2IN1</name>
              <description>[1:1] P2IN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2IN2</name>
              <description>[2:2] P2IN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2IN3</name>
              <description>[3:3] P2IN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2IN4</name>
              <description>[4:4] P2IN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2IN5</name>
              <description>[5:5] P2IN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2IN6</name>
              <description>[6:6] P2IN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2IN7</name>
              <description>[7:7] P2IN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P2OUT</name>
          <addressOffset>0x0203</addressOffset>
          <size>8</size>
          <description>Port 2 Output</description>
          <fields>
            <field>
              <name>P2OUT0</name>
              <description>[0:0] P2OUT0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2OUT1</name>
              <description>[1:1] P2OUT1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2OUT2</name>
              <description>[2:2] P2OUT2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2OUT3</name>
              <description>[3:3] P2OUT3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2OUT4</name>
              <description>[4:4] P2OUT4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2OUT5</name>
              <description>[5:5] P2OUT5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2OUT6</name>
              <description>[6:6] P2OUT6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2OUT7</name>
              <description>[7:7] P2OUT7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
