MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>P2DIR</name>
          <addressOffset>0x0205</addressOffset>
          <size>8</size>
          <description>Port 2 Direction</description>
          <fields>
            <field>
              <name>P2DIR0</name>
              <description>[0:0] P2DIR0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2DIR1</name>
              <description>[1:1] P2DIR1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2DIR2</name>
              <description>[2:2] P2DIR2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2DIR3</name>
              <description>[3:3] P2DIR3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2DIR4</name>
              <description>[4:4] P2DIR4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2DIR5</name>
              <description>[5:5] P2DIR5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2DIR6</name>
              <description>[6:6] P2DIR6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2DIR7</name>
              <description>[7:7] P2DIR7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P2REN</name>
          <addressOffset>0x0207</addressOffset>
          <size>8</size>
          <description>Port 2 Resistor Enable</description>
          <fields>
            <field>
              <name>P2REN0</name>
              <description>[0:0] P2REN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2REN1</name>
              <description>[1:1] P2REN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2REN2</name>
              <description>[2:2] P2REN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2REN3</name>
              <description>[3:3] P2REN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2REN4</name>
              <description>[4:4] P2REN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2REN5</name>
              <description>[5:5] P2REN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2REN6</name>
              <description>[6:6] P2REN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2REN7</name>
              <description>[7:7] P2REN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P2SEL0</name>
          <addressOffset>0x020B</addressOffset>
          <size>8</size>
          <description>Port 2 Selection 0</description>
          <fields>
            <field>
              <name>P2SEL0_0</name>
              <description>[0:0] P2SEL0_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2SEL0_1</name>
              <description>[1:1] P2SEL0_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2SEL0_2</name>
              <description>[2:2] P2SEL0_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2SEL0_3</name>
              <description>[3:3] P2SEL0_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2SEL0_4</name>
              <description>[4:4] P2SEL0_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2SEL0_5</name>
              <description>[5:5] P2SEL0_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2SEL0_6</name>
              <description>[6:6] P2SEL0_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2SEL0_7</name>
              <description>[7:7] P2SEL0_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P2SEL1</name>
          <addressOffset>0x020D</addressOffset>
          <size>8</size>
          <description>Port 2 Selection 1</description>
          <fields>
            <field>
              <name>P2SEL1_0</name>
              <description>[0:0] P2SEL1_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2SEL1_1</name>
              <description>[1:1] P2SEL1_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2SEL1_2</name>
              <description>[2:2] P2SEL1_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2SEL1_3</name>
              <description>[3:3] P2SEL1_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2SEL1_4</name>
              <description>[4:4] P2SEL1_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2SEL1_5</name>
              <description>[5:5] P2SEL1_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2SEL1_6</name>
              <description>[6:6] P2SEL1_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2SEL1_7</name>
              <description>[7:7] P2SEL1_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P2SELC</name>
          <addressOffset>0x0217</addressOffset>
          <size>8</size>
          <description>Port 2 Complement Selection</description>
          <fields>
            <field>
              <name>P2SELC_0</name>
              <description>[0:0] P2SELC_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2SELC_1</name>
              <description>[1:1] P2SELC_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2SELC_2</name>
              <description>[2:2] P2SELC_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2SELC_3</name>
              <description>[3:3] P2SELC_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2SELC_4</name>
              <description>[4:4] P2SELC_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2SELC_5</name>
              <description>[5:5] P2SELC_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2SELC_6</name>
              <description>[6:6] P2SELC_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2SELC_7</name>
              <description>[7:7] P2SELC_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P2IV</name>
          <addressOffset>0x021E</addressOffset>
          <size>16</size>
          <description>Port 2 Interrupt Vector Word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P2IES</name>
          <addressOffset>0x0219</addressOffset>
          <size>8</size>
          <description>Port 2 Interrupt Edge Select</description>
          <fields>
            <field>
              <name>P2IES0</name>
              <description>[0:0] P2IES0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2IES1</name>
              <description>[1:1] P2IES1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2IES2</name>
              <description>[2:2] P2IES2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2IES3</name>
              <description>[3:3] P2IES3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2IES4</name>
              <description>[4:4] P2IES4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2IES5</name>
              <description>[5:5] P2IES5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2IES6</name>
              <description>[6:6] P2IES6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2IES7</name>
              <description>[7:7] P2IES7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P2IE</name>
          <addressOffset>0x021B</addressOffset>
          <size>8</size>
          <description>Port 2 Interrupt Enable</description>
          <fields>
            <field>
              <name>P2IE0</name>
              <description>[0:0] P2IE0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2IE1</name>
              <description>[1:1] P2IE1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2IE2</name>
              <description>[2:2] P2IE2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2IE3</name>
              <description>[3:3] P2IE3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2IE4</name>
              <description>[4:4] P2IE4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2IE5</name>
              <description>[5:5] P2IE5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2IE6</name>
              <description>[6:6] P2IE6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2IE7</name>
              <description>[7:7] P2IE7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P2IFG</name>
          <addressOffset>0x021D</addressOffset>
          <size>8</size>
          <description>Port 2 Interrupt Flag</description>
          <fields>
            <field>
              <name>P2IFG0</name>
              <description>[0:0] P2IFG0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P2IFG1</name>
              <description>[1:1] P2IFG1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P2IFG2</name>
              <description>[2:2] P2IFG2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P2IFG3</name>
              <description>[3:3] P2IFG3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P2IFG4</name>
              <description>[4:4] P2IFG4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P2IFG5</name>
              <description>[5:5] P2IFG5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P2IFG6</name>
              <description>[6:6] P2IFG6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P2IFG7</name>
              <description>[7:7] P2IFG7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
