MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Port_B</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Port B</description>
      <registers>
        <register>
          <name>PBIN</name>
          <addressOffset>0x0220</addressOffset>
          <size>16</size>
          <description>Port B Input</description>
          <fields>
            <field>
              <name>PBIN0</name>
              <description>[0:0] PBIN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBIN1</name>
              <description>[1:1] PBIN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBIN2</name>
              <description>[2:2] PBIN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBIN3</name>
              <description>[3:3] PBIN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBIN4</name>
              <description>[4:4] PBIN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBIN5</name>
              <description>[5:5] PBIN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBIN6</name>
              <description>[6:6] PBIN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBIN7</name>
              <description>[7:7] PBIN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBIN8</name>
              <description>[8:8] PBIN8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBIN9</name>
              <description>[9:9] PBIN9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBIN10</name>
              <description>[10:10] PBIN10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBIN11</name>
              <description>[11:11] PBIN11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBIN12</name>
              <description>[12:12] PBIN12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBIN13</name>
              <description>[13:13] PBIN13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBIN14</name>
              <description>[14:14] PBIN14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBIN15</name>
              <description>[15:15] PBIN15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PBOUT</name>
          <addressOffset>0x0222</addressOffset>
          <size>16</size>
          <description>Port B Output</description>
          <fields>
            <field>
              <name>PBOUT0</name>
              <description>[0:0] PBOUT0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBOUT1</name>
              <description>[1:1] PBOUT1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBOUT2</name>
              <description>[2:2] PBOUT2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBOUT3</name>
              <description>[3:3] PBOUT3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBOUT4</name>
              <description>[4:4] PBOUT4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBOUT5</name>
              <description>[5:5] PBOUT5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBOUT6</name>
              <description>[6:6] PBOUT6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBOUT7</name>
              <description>[7:7] PBOUT7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBOUT8</name>
              <description>[8:8] PBOUT8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBOUT9</name>
              <description>[9:9] PBOUT9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBOUT10</name>
              <description>[10:10] PBOUT10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBOUT11</name>
              <description>[11:11] PBOUT11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBOUT12</name>
              <description>[12:12] PBOUT12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBOUT13</name>
              <description>[13:13] PBOUT13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBOUT14</name>
              <description>[14:14] PBOUT14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBOUT15</name>
              <description>[15:15] PBOUT15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PBDIR</name>
          <addressOffset>0x0224</addressOffset>
          <size>16</size>
          <description>Port B Direction</description>
          <fields>
            <field>
              <name>PBDIR0</name>
              <description>[0:0] PBDIR0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBDIR1</name>
              <description>[1:1] PBDIR1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBDIR2</name>
              <description>[2:2] PBDIR2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBDIR3</name>
              <description>[3:3] PBDIR3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBDIR4</name>
              <description>[4:4] PBDIR4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBDIR5</name>
              <description>[5:5] PBDIR5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBDIR6</name>
              <description>[6:6] PBDIR6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBDIR7</name>
              <description>[7:7] PBDIR7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBDIR8</name>
              <description>[8:8] PBDIR8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBDIR9</name>
              <description>[9:9] PBDIR9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBDIR10</name>
              <description>[10:10] PBDIR10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBDIR11</name>
              <description>[11:11] PBDIR11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBDIR12</name>
              <description>[12:12] PBDIR12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBDIR13</name>
              <description>[13:13] PBDIR13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBDIR14</name>
              <description>[14:14] PBDIR14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBDIR15</name>
              <description>[15:15] PBDIR15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PBREN</name>
          <addressOffset>0x0226</addressOffset>
          <size>16</size>
          <description>Port B Resistor Enable</description>
          <fields>
            <field>
              <name>PBREN0</name>
              <description>[0:0] PBREN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBREN1</name>
              <description>[1:1] PBREN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBREN2</name>
              <description>[2:2] PBREN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBREN3</name>
              <description>[3:3] PBREN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBREN4</name>
              <description>[4:4] PBREN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBREN5</name>
              <description>[5:5] PBREN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBREN6</name>
              <description>[6:6] PBREN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBREN7</name>
              <description>[7:7] PBREN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBREN8</name>
              <description>[8:8] PBREN8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBREN9</name>
              <description>[9:9] PBREN9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBREN10</name>
              <description>[10:10] PBREN10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBREN11</name>
              <description>[11:11] PBREN11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBREN12</name>
              <description>[12:12] PBREN12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBREN13</name>
              <description>[13:13] PBREN13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBREN14</name>
              <description>[14:14] PBREN14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBREN15</name>
              <description>[15:15] PBREN15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PBSEL0</name>
          <addressOffset>0x022A</addressOffset>
          <size>16</size>
          <description>Port B Selection 0</description>
          <fields>
            <field>
              <name>PBSEL0_0</name>
              <description>[0:0] PBSEL0_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBSEL0_1</name>
              <description>[1:1] PBSEL0_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBSEL0_2</name>
              <description>[2:2] PBSEL0_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBSEL0_3</name>
              <description>[3:3] PBSEL0_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBSEL0_4</name>
              <description>[4:4] PBSEL0_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBSEL0_5</name>
              <description>[5:5] PBSEL0_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBSEL0_6</name>
              <description>[6:6] PBSEL0_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBSEL0_7</name>
              <description>[7:7] PBSEL0_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBSEL0_8</name>
              <description>[8:8] PBSEL0_8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBSEL0_9</name>
              <description>[9:9] PBSEL0_9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBSEL0_10</name>
              <description>[10:10] PBSEL0_10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBSEL0_11</name>
              <description>[11:11] PBSEL0_11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBSEL0_12</name>
              <description>[12:12] PBSEL0_12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBSEL0_13</name>
              <description>[13:13] PBSEL0_13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBSEL0_14</name>
              <description>[14:14] PBSEL0_14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBSEL0_15</name>
              <description>[15:15] PBSEL0_15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PBSEL1</name>
          <addressOffset>0x022C</addressOffset>
          <size>16</size>
          <description>Port B Selection 1</description>
          <fields>
            <field>
              <name>PBSEL1_0</name>
              <description>[0:0] PBSEL1_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBSEL1_1</name>
              <description>[1:1] PBSEL1_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBSEL1_2</name>
              <description>[2:2] PBSEL1_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBSEL1_3</name>
              <description>[3:3] PBSEL1_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBSEL1_4</name>
              <description>[4:4] PBSEL1_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBSEL1_5</name>
              <description>[5:5] PBSEL1_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBSEL1_6</name>
              <description>[6:6] PBSEL1_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBSEL1_7</name>
              <description>[7:7] PBSEL1_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBSEL1_8</name>
              <description>[8:8] PBSEL1_8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBSEL1_9</name>
              <description>[9:9] PBSEL1_9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBSEL1_10</name>
              <description>[10:10] PBSEL1_10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBSEL1_11</name>
              <description>[11:11] PBSEL1_11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBSEL1_12</name>
              <description>[12:12] PBSEL1_12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBSEL1_13</name>
              <description>[13:13] PBSEL1_13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBSEL1_14</name>
              <description>[14:14] PBSEL1_14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBSEL1_15</name>
              <description>[15:15] PBSEL1_15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
