MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>PBSELC</name>
          <addressOffset>0x0236</addressOffset>
          <size>16</size>
          <description>Port B Complement Selection</description>
          <fields>
            <field>
              <name>PBSELC_0</name>
              <description>[0:0] PBSELC_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBSELC_1</name>
              <description>[1:1] PBSELC_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBSELC_2</name>
              <description>[2:2] PBSELC_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBSELC_3</name>
              <description>[3:3] PBSELC_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBSELC_4</name>
              <description>[4:4] PBSELC_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBSELC_5</name>
              <description>[5:5] PBSELC_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBSELC_6</name>
              <description>[6:6] PBSELC_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBSELC_7</name>
              <description>[7:7] PBSELC_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBSELC_8</name>
              <description>[8:8] PBSELC_8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBSELC_9</name>
              <description>[9:9] PBSELC_9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBSELC_10</name>
              <description>[10:10] PBSELC_10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBSELC_11</name>
              <description>[11:11] PBSELC_11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBSELC_12</name>
              <description>[12:12] PBSELC_12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBSELC_13</name>
              <description>[13:13] PBSELC_13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBSELC_14</name>
              <description>[14:14] PBSELC_14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBSELC_15</name>
              <description>[15:15] PBSELC_15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PBIES</name>
          <addressOffset>0x0238</addressOffset>
          <size>16</size>
          <description>Port B Interrupt Edge Select</description>
          <fields>
            <field>
              <name>PBIES0</name>
              <description>[0:0] PBIES0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBIES1</name>
              <description>[1:1] PBIES1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBIES2</name>
              <description>[2:2] PBIES2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBIES3</name>
              <description>[3:3] PBIES3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBIES4</name>
              <description>[4:4] PBIES4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBIES5</name>
              <description>[5:5] PBIES5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBIES6</name>
              <description>[6:6] PBIES6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBIES7</name>
              <description>[7:7] PBIES7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBIES8</name>
              <description>[8:8] PBIES8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBIES9</name>
              <description>[9:9] PBIES9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBIES10</name>
              <description>[10:10] PBIES10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBIES11</name>
              <description>[11:11] PBIES11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBIES12</name>
              <description>[12:12] PBIES12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBIES13</name>
              <description>[13:13] PBIES13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBIES14</name>
              <description>[14:14] PBIES14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBIES15</name>
              <description>[15:15] PBIES15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PBIE</name>
          <addressOffset>0x023A</addressOffset>
          <size>16</size>
          <description>Port B Interrupt Enable</description>
          <fields>
            <field>
              <name>PBIE0</name>
              <description>[0:0] PBIE0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBIE1</name>
              <description>[1:1] PBIE1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBIE2</name>
              <description>[2:2] PBIE2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBIE3</name>
              <description>[3:3] PBIE3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBIE4</name>
              <description>[4:4] PBIE4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBIE5</name>
              <description>[5:5] PBIE5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBIE6</name>
              <description>[6:6] PBIE6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBIE7</name>
              <description>[7:7] PBIE7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBIE8</name>
              <description>[8:8] PBIE8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBIE9</name>
              <description>[9:9] PBIE9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBIE10</name>
              <description>[10:10] PBIE10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBIE11</name>
              <description>[11:11] PBIE11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBIE12</name>
              <description>[12:12] PBIE12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBIE13</name>
              <description>[13:13] PBIE13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBIE14</name>
              <description>[14:14] PBIE14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBIE15</name>
              <description>[15:15] PBIE15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PBIFG</name>
          <addressOffset>0x023C</addressOffset>
          <size>16</size>
          <description>Port B Interrupt Flag</description>
          <fields>
            <field>
              <name>PBIFG0</name>
              <description>[0:0] PBIFG0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PBIFG1</name>
              <description>[1:1] PBIFG1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PBIFG2</name>
              <description>[2:2] PBIFG2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PBIFG3</name>
              <description>[3:3] PBIFG3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PBIFG4</name>
              <description>[4:4] PBIFG4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PBIFG5</name>
              <description>[5:5] PBIFG5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PBIFG6</name>
              <description>[6:6] PBIFG6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PBIFG7</name>
              <description>[7:7] PBIFG7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PBIFG8</name>
              <description>[8:8] PBIFG8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PBIFG9</name>
              <description>[9:9] PBIFG9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBIFG10</name>
              <description>[10:10] PBIFG10</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBIFG11</name>
              <description>[11:11] PBIFG11</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBIFG12</name>
              <description>[12:12] PBIFG12</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBIFG13</name>
              <description>[13:13] PBIFG13</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBIFG14</name>
              <description>[14:14] PBIFG14</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBIFG15</name>
              <description>[15:15] PBIFG15</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
