MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Port_3_4</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Port 3/4</description>
      <registers>
        <register>
          <name>P3IN</name>
          <addressOffset>0x0220</addressOffset>
          <size>8</size>
          <description>Port 3 Input</description>
          <fields>
            <field>
              <name>P3IN0</name>
              <description>[0:0] P3IN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3IN1</name>
              <description>[1:1] P3IN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3IN2</name>
              <description>[2:2] P3IN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3IN3</name>
              <description>[3:3] P3IN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3IN4</name>
              <description>[4:4] P3IN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3IN5</name>
              <description>[5:5] P3IN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3IN6</name>
              <description>[6:6] P3IN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3IN7</name>
              <description>[7:7] P3IN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P3OUT</name>
          <addressOffset>0x0222</addressOffset>
          <size>8</size>
          <description>Port 3 Output</description>
          <fields>
            <field>
              <name>P3OUT0</name>
              <description>[0:0] P3OUT0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3OUT1</name>
              <description>[1:1] P3OUT1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3OUT2</name>
              <description>[2:2] P3OUT2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3OUT3</name>
              <description>[3:3] P3OUT3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3OUT4</name>
              <description>[4:4] P3OUT4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3OUT5</name>
              <description>[5:5] P3OUT5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3OUT6</name>
              <description>[6:6] P3OUT6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3OUT7</name>
              <description>[7:7] P3OUT7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P3DIR</name>
          <addressOffset>0x0224</addressOffset>
          <size>8</size>
          <description>Port 3 Direction</description>
          <fields>
            <field>
              <name>P3DIR0</name>
              <description>[0:0] P3DIR0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3DIR1</name>
              <description>[1:1] P3DIR1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3DIR2</name>
              <description>[2:2] P3DIR2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3DIR3</name>
              <description>[3:3] P3DIR3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3DIR4</name>
              <description>[4:4] P3DIR4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3DIR5</name>
              <description>[5:5] P3DIR5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3DIR6</name>
              <description>[6:6] P3DIR6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3DIR7</name>
              <description>[7:7] P3DIR7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P3REN</name>
          <addressOffset>0x0226</addressOffset>
          <size>8</size>
          <description>Port 3 Resistor Enable</description>
          <fields>
            <field>
              <name>P3REN0</name>
              <description>[0:0] P3REN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3REN1</name>
              <description>[1:1] P3REN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3REN2</name>
              <description>[2:2] P3REN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3REN3</name>
              <description>[3:3] P3REN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3REN4</name>
              <description>[4:4] P3REN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3REN5</name>
              <description>[5:5] P3REN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3REN6</name>
              <description>[6:6] P3REN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3REN7</name>
              <description>[7:7] P3REN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P3SEL0</name>
          <addressOffset>0x022A</addressOffset>
          <size>8</size>
          <description>Port 3 Selection 0</description>
          <fields>
            <field>
              <name>P3SEL0_0</name>
              <description>[0:0] P3SEL0_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3SEL0_1</name>
              <description>[1:1] P3SEL0_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3SEL0_2</name>
              <description>[2:2] P3SEL0_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3SEL0_3</name>
              <description>[3:3] P3SEL0_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3SEL0_4</name>
              <description>[4:4] P3SEL0_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3SEL0_5</name>
              <description>[5:5] P3SEL0_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3SEL0_6</name>
              <description>[6:6] P3SEL0_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3SEL0_7</name>
              <description>[7:7] P3SEL0_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P3SEL1</name>
          <addressOffset>0x022C</addressOffset>
          <size>8</size>
          <description>Port 3 Selection 1</description>
          <fields>
            <field>
              <name>P3SEL1_0</name>
              <description>[0:0] P3SEL1_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3SEL1_1</name>
              <description>[1:1] P3SEL1_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3SEL1_2</name>
              <description>[2:2] P3SEL1_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3SEL1_3</name>
              <description>[3:3] P3SEL1_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3SEL1_4</name>
              <description>[4:4] P3SEL1_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3SEL1_5</name>
              <description>[5:5] P3SEL1_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3SEL1_6</name>
              <description>[6:6] P3SEL1_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3SEL1_7</name>
              <description>[7:7] P3SEL1_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P3SELC</name>
          <addressOffset>0x0236</addressOffset>
          <size>8</size>
          <description>Port 3 Complement Selection</description>
          <fields>
            <field>
              <name>P3SELC_0</name>
              <description>[0:0] P3SELC_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3SELC_1</name>
              <description>[1:1] P3SELC_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3SELC_2</name>
              <description>[2:2] P3SELC_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3SELC_3</name>
              <description>[3:3] P3SELC_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3SELC_4</name>
              <description>[4:4] P3SELC_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3SELC_5</name>
              <description>[5:5] P3SELC_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3SELC_6</name>
              <description>[6:6] P3SELC_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3SELC_7</name>
              <description>[7:7] P3SELC_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P3IV</name>
          <addressOffset>0x022E</addressOffset>
          <size>16</size>
          <description>Port 3 Interrupt Vector Word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P3IES</name>
          <addressOffset>0x0238</addressOffset>
          <size>8</size>
          <description>Port 3 Interrupt Edge Select</description>
          <fields>
            <field>
              <name>P3IES0</name>
              <description>[0:0] P3IES0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3IES1</name>
              <description>[1:1] P3IES1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3IES2</name>
              <description>[2:2] P3IES2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3IES3</name>
              <description>[3:3] P3IES3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3IES4</name>
              <description>[4:4] P3IES4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3IES5</name>
              <description>[5:5] P3IES5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3IES6</name>
              <description>[6:6] P3IES6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3IES7</name>
              <description>[7:7] P3IES7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P3IE</name>
          <addressOffset>0x023A</addressOffset>
          <size>8</size>
          <description>Port 3 Interrupt Enable</description>
          <fields>
            <field>
              <name>P3IE0</name>
              <description>[0:0] P3IE0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3IE1</name>
              <description>[1:1] P3IE1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3IE2</name>
              <description>[2:2] P3IE2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3IE3</name>
              <description>[3:3] P3IE3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3IE4</name>
              <description>[4:4] P3IE4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3IE5</name>
              <description>[5:5] P3IE5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3IE6</name>
              <description>[6:6] P3IE6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3IE7</name>
              <description>[7:7] P3IE7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P3IFG</name>
          <addressOffset>0x023C</addressOffset>
          <size>8</size>
          <description>Port 3 Interrupt Flag</description>
          <fields>
            <field>
              <name>P3IFG0</name>
              <description>[0:0] P3IFG0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P3IFG1</name>
              <description>[1:1] P3IFG1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P3IFG2</name>
              <description>[2:2] P3IFG2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P3IFG3</name>
              <description>[3:3] P3IFG3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P3IFG4</name>
              <description>[4:4] P3IFG4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P3IFG5</name>
              <description>[5:5] P3IFG5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P3IFG6</name>
              <description>[6:6] P3IFG6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P3IFG7</name>
              <description>[7:7] P3IFG7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P4IN</name>
          <addressOffset>0x0221</addressOffset>
          <size>8</size>
          <description>Port 4 Input</description>
          <fields>
            <field>
              <name>P4IN0</name>
              <description>[0:0] P4IN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4IN1</name>
              <description>[1:1] P4IN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4IN2</name>
              <description>[2:2] P4IN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4IN3</name>
              <description>[3:3] P4IN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4IN4</name>
              <description>[4:4] P4IN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4IN5</name>
              <description>[5:5] P4IN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4IN6</name>
              <description>[6:6] P4IN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4IN7</name>
              <description>[7:7] P4IN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P4OUT</name>
          <addressOffset>0x0223</addressOffset>
          <size>8</size>
          <description>Port 4 Output</description>
          <fields>
            <field>
              <name>P4OUT0</name>
              <description>[0:0] P4OUT0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4OUT1</name>
              <description>[1:1] P4OUT1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4OUT2</name>
              <description>[2:2] P4OUT2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4OUT3</name>
              <description>[3:3] P4OUT3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4OUT4</name>
              <description>[4:4] P4OUT4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4OUT5</name>
              <description>[5:5] P4OUT5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4OUT6</name>
              <description>[6:6] P4OUT6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4OUT7</name>
              <description>[7:7] P4OUT7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
