MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>P4DIR</name>
          <addressOffset>0x0225</addressOffset>
          <size>8</size>
          <description>Port 4 Direction</description>
          <fields>
            <field>
              <name>P4DIR0</name>
              <description>[0:0] P4DIR0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4DIR1</name>
              <description>[1:1] P4DIR1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4DIR2</name>
              <description>[2:2] P4DIR2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4DIR3</name>
              <description>[3:3] P4DIR3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4DIR4</name>
              <description>[4:4] P4DIR4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4DIR5</name>
              <description>[5:5] P4DIR5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4DIR6</name>
              <description>[6:6] P4DIR6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4DIR7</name>
              <description>[7:7] P4DIR7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P4REN</name>
          <addressOffset>0x0227</addressOffset>
          <size>8</size>
          <description>Port 4 Resistor Enable</description>
          <fields>
            <field>
              <name>P4REN0</name>
              <description>[0:0] P4REN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4REN1</name>
              <description>[1:1] P4REN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4REN2</name>
              <description>[2:2] P4REN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4REN3</name>
              <description>[3:3] P4REN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4REN4</name>
              <description>[4:4] P4REN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4REN5</name>
              <description>[5:5] P4REN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4REN6</name>
              <description>[6:6] P4REN6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4REN7</name>
              <description>[7:7] P4REN7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P4SEL0</name>
          <addressOffset>0x022B</addressOffset>
          <size>8</size>
          <description>Port 4 Selection 0</description>
          <fields>
            <field>
              <name>P4SEL0_0</name>
              <description>[0:0] P4SEL0_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4SEL0_1</name>
              <description>[1:1] P4SEL0_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4SEL0_2</name>
              <description>[2:2] P4SEL0_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4SEL0_3</name>
              <description>[3:3] P4SEL0_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4SEL0_4</name>
              <description>[4:4] P4SEL0_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4SEL0_5</name>
              <description>[5:5] P4SEL0_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4SEL0_6</name>
              <description>[6:6] P4SEL0_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4SEL0_7</name>
              <description>[7:7] P4SEL0_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P4SEL1</name>
          <addressOffset>0x022D</addressOffset>
          <size>8</size>
          <description>Port 4 Selection 1</description>
          <fields>
            <field>
              <name>P4SEL1_0</name>
              <description>[0:0] P4SEL1_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4SEL1_1</name>
              <description>[1:1] P4SEL1_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4SEL1_2</name>
              <description>[2:2] P4SEL1_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4SEL1_3</name>
              <description>[3:3] P4SEL1_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4SEL1_4</name>
              <description>[4:4] P4SEL1_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4SEL1_5</name>
              <description>[5:5] P4SEL1_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4SEL1_6</name>
              <description>[6:6] P4SEL1_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4SEL1_7</name>
              <description>[7:7] P4SEL1_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P4SELC</name>
          <addressOffset>0x0237</addressOffset>
          <size>8</size>
          <description>Port 4 Complement Selection</description>
          <fields>
            <field>
              <name>P4SELC_0</name>
              <description>[0:0] P4SELC_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4SELC_1</name>
              <description>[1:1] P4SELC_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4SELC_2</name>
              <description>[2:2] P4SELC_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4SELC_3</name>
              <description>[3:3] P4SELC_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4SELC_4</name>
              <description>[4:4] P4SELC_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4SELC_5</name>
              <description>[5:5] P4SELC_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4SELC_6</name>
              <description>[6:6] P4SELC_6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4SELC_7</name>
              <description>[7:7] P4SELC_7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P4IV</name>
          <addressOffset>0x023E</addressOffset>
          <size>16</size>
          <description>Port 4 Interrupt Vector Word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P4IES</name>
          <addressOffset>0x0239</addressOffset>
          <size>8</size>
          <description>Port 4 Interrupt Edge Select</description>
          <fields>
            <field>
              <name>P4IES0</name>
              <description>[0:0] P4IES0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4IES1</name>
              <description>[1:1] P4IES1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4IES2</name>
              <description>[2:2] P4IES2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4IES3</name>
              <description>[3:3] P4IES3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4IES4</name>
              <description>[4:4] P4IES4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4IES5</name>
              <description>[5:5] P4IES5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4IES6</name>
              <description>[6:6] P4IES6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4IES7</name>
              <description>[7:7] P4IES7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P4IE</name>
          <addressOffset>0x023B</addressOffset>
          <size>8</size>
          <description>Port 4 Interrupt Enable</description>
          <fields>
            <field>
              <name>P4IE0</name>
              <description>[0:0] P4IE0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4IE1</name>
              <description>[1:1] P4IE1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4IE2</name>
              <description>[2:2] P4IE2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4IE3</name>
              <description>[3:3] P4IE3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4IE4</name>
              <description>[4:4] P4IE4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4IE5</name>
              <description>[5:5] P4IE5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4IE6</name>
              <description>[6:6] P4IE6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4IE7</name>
              <description>[7:7] P4IE7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>P4IFG</name>
          <addressOffset>0x023D</addressOffset>
          <size>8</size>
          <description>Port 4 Interrupt Flag</description>
          <fields>
            <field>
              <name>P4IFG0</name>
              <description>[0:0] P4IFG0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>P4IFG1</name>
              <description>[1:1] P4IFG1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>P4IFG2</name>
              <description>[2:2] P4IFG2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>P4IFG3</name>
              <description>[3:3] P4IFG3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>P4IFG4</name>
              <description>[4:4] P4IFG4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>P4IFG5</name>
              <description>[5:5] P4IFG5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>P4IFG6</name>
              <description>[6:6] P4IFG6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>P4IFG7</name>
              <description>[7:7] P4IFG7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
