MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Port_J</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Port J</description>
      <registers>
        <register>
          <name>PJIN</name>
          <addressOffset>0x0320</addressOffset>
          <size>16</size>
          <description>Port J Input</description>
          <fields>
            <field>
              <name>PJIN0</name>
              <description>[0:0] PJIN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PJIN1</name>
              <description>[1:1] PJIN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PJIN2</name>
              <description>[2:2] PJIN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PJIN3</name>
              <description>[3:3] PJIN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PJIN4</name>
              <description>[4:4] PJIN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PJIN5</name>
              <description>[5:5] PJIN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PJOUT</name>
          <addressOffset>0x0322</addressOffset>
          <size>16</size>
          <description>Port J Output</description>
          <fields>
            <field>
              <name>PJOUT0</name>
              <description>[0:0] PJOUT0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PJOUT1</name>
              <description>[1:1] PJOUT1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PJOUT2</name>
              <description>[2:2] PJOUT2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PJOUT3</name>
              <description>[3:3] PJOUT3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PJOUT4</name>
              <description>[4:4] PJOUT4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PJOUT5</name>
              <description>[5:5] PJOUT5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PJDIR</name>
          <addressOffset>0x0324</addressOffset>
          <size>16</size>
          <description>Port J Direction</description>
          <fields>
            <field>
              <name>PJDIR0</name>
              <description>[0:0] PJDIR0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PJDIR1</name>
              <description>[1:1] PJDIR1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PJDIR2</name>
              <description>[2:2] PJDIR2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PJDIR3</name>
              <description>[3:3] PJDIR3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PJDIR4</name>
              <description>[4:4] PJDIR4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PJDIR5</name>
              <description>[5:5] PJDIR5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PJREN</name>
          <addressOffset>0x0326</addressOffset>
          <size>16</size>
          <description>Port J Resistor Enable</description>
          <fields>
            <field>
              <name>PJREN0</name>
              <description>[0:0] PJREN0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PJREN1</name>
              <description>[1:1] PJREN1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PJREN2</name>
              <description>[2:2] PJREN2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PJREN3</name>
              <description>[3:3] PJREN3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PJREN4</name>
              <description>[4:4] PJREN4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PJREN5</name>
              <description>[5:5] PJREN5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PJSEL0</name>
          <addressOffset>0x032A</addressOffset>
          <size>16</size>
          <description>Port J Selection 0</description>
          <fields>
            <field>
              <name>PJSEL0_0</name>
              <description>[0:0] PJSEL0_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PJSEL0_1</name>
              <description>[1:1] PJSEL0_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PJSEL0_2</name>
              <description>[2:2] PJSEL0_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PJSEL0_3</name>
              <description>[3:3] PJSEL0_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PJSEL0_4</name>
              <description>[4:4] PJSEL0_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PJSEL0_5</name>
              <description>[5:5] PJSEL0_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PJSEL1</name>
          <addressOffset>0x032C</addressOffset>
          <size>16</size>
          <description>Port J Selection 1</description>
          <fields>
            <field>
              <name>PJSEL1_0</name>
              <description>[0:0] PJSEL1_0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>PJSEL1_1</name>
              <description>[1:1] PJSEL1_1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PJSEL1_2</name>
              <description>[2:2] PJSEL1_2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PJSEL1_3</name>
              <description>[3:3] PJSEL1_3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PJSEL1_4</name>
              <description>[4:4] PJSEL1_4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PJSEL1_5</name>
              <description>[5:5] PJSEL1_5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PJSELC</name>
          <addressOffset>0x0336</addressOffset>
          <size>16</size>
          <description>Port J Complement Selection</description>
          <resetValue>0</resetValue>
        </register>
