MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Shared_Reference</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Shared Reference</description>
      <registers>
        <register>
          <name>REFCTL0</name>
          <addressOffset>0x01B0</addressOffset>
          <size>16</size>
          <description>REF Shared Reference control register 0</description>
          <fields>
            <field>
              <name>REFON</name>
              <description>[0:0] REF Reference On</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>REFTCOFF</name>
              <description>[3:3] REF Temp.Sensor off</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>REFVSEL</name>
              <description>[5:4] REF Reference Voltage Level Select Bit:0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFVSEL_0</name>
                  <value>0</value>
                  <description>REF Reference Voltage Level Select 1.5V</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_1</name>
                  <value>1</value>
                  <description>REF Reference Voltage Level Select 2.0V</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_2</name>
                  <value>2</value>
                  <description>REF Reference Voltage Level Select 2.5V</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_3</name>
                  <value>3</value>
                  <description>REF Reference Voltage Level Select 2.5V</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFGENACT</name>
              <description>[8:8] REF Reference generator active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>REFBGACT</name>
              <description>[9:9] REF Reference bandgap active</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>REFGENBUSY</name>
              <description>[10:10] REF Reference generator busy</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>BGMODE</name>
              <description>[11:11] REF Bandgap mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC_B__Real_Time_Clock</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RTC_B  Real Time Clock</description>
      <registers>
        <register>
          <name>RTCCTL01</name>
          <addressOffset>0x04A0</addressOffset>
          <size>16</size>
          <description>Real Timer Control 0/1</description>
          <fields>
            <field>
              <name>RTCRDYIFG</name>
              <description>[0:0] RTC Ready Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>RTCAIFG</name>
              <description>[1:1] RTC Alarm Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RTCTEVIFG</name>
              <description>[2:2] RTC Time Event Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTCOFIFG</name>
              <description>[3:3] RTC 32kHz cyrstal oscillator fault interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RTCRDYIE</name>
              <description>[4:4] RTC Ready Interrupt Enable Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RTCAIE</name>
              <description>[5:5] RTC Alarm Interrupt Enable Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RTCTEVIE</name>
              <description>[6:6] RTC Time Event Interrupt Enable Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RTCOFIE</name>
              <description>[7:7] RTC 32kHz cyrstal oscillator fault interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RTCTEV</name>
              <description>[9:8] RTC Time Event 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCTEV_0</name>
                  <value>0</value>
                  <description>RTC Time Event: 0 (Min. changed)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEV_1</name>
                  <value>1</value>
                  <description>RTC Time Event: 1 (Hour changed)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEV_2</name>
                  <value>2</value>
                  <description>RTC Time Event: 2 (12:00 changed)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEV_3</name>
                  <value>3</value>
                  <description>RTC Time Event: 3 (00:00 changed)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCRDY</name>
              <description>[12:12] RTC Ready</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RTCHOLD</name>
              <description>[14:14] RTC Hold</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RTCBCD</name>
              <description>[15:15] RTC BCD  0:Binary / 1:BCD</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCCTL23</name>
          <addressOffset>0x04A2</addressOffset>
          <size>16</size>
          <description>Real Timer Control 2/3</description>
          <fields>
            <field>
              <name>RTCCAL0</name>
              <description>[0:0] RTC Calibration Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>RTCCAL1</name>
              <description>[1:1] RTC Calibration Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RTCCAL2</name>
              <description>[2:2] RTC Calibration Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTCCAL3</name>
              <description>[3:3] RTC Calibration Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RTCCAL4</name>
              <description>[4:4] RTC Calibration Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RTCCAL5</name>
              <description>[5:5] RTC Calibration Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RTCCALS</name>
              <description>[7:7] RTC Calibration Sign</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RTCCALF</name>
              <description>[9:8] RTC Calibration Frequency Bit 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCCALF_0</name>
                  <value>0</value>
                  <description>RTC Calibration Frequency: No Output</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCALF_1</name>
                  <value>1</value>
                  <description>RTC Calibration Frequency: 512 Hz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCALF_2</name>
                  <value>2</value>
                  <description>RTC Calibration Frequency: 256 Hz</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCALF_3</name>
                  <value>3</value>
                  <description>RTC Calibration Frequency: 1 Hz</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCPS0CTL</name>
          <addressOffset>0x04A8</addressOffset>
          <size>16</size>
          <description>Real Timer Prescale Timer 0 Control</description>
          <fields>
            <field>
              <name>RT0PSIFG</name>
              <description>[0:0] RTC Prescale Timer 0 Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>RT0PSIE</name>
              <description>[1:1] RTC Prescale Timer 0 Interrupt Enable Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RT0IP</name>
              <description>[4:2] RTC Prescale Timer 0 Interrupt Interval Bit: 2</description>
              <bitWidth>3</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT0IP_0</name>
                  <value>0</value>
                  <description>RTC Prescale Timer 0 Interrupt Interval /2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_1</name>
                  <value>1</value>
                  <description>RTC Prescale Timer 0 Interrupt Interval /4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_2</name>
                  <value>2</value>
                  <description>RTC Prescale Timer 0 Interrupt Interval /8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_3</name>
                  <value>3</value>
                  <description>RTC Prescale Timer 0 Interrupt Interval /16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_4</name>
                  <value>4</value>
                  <description>RTC Prescale Timer 0 Interrupt Interval /32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_5</name>
                  <value>5</value>
                  <description>RTC Prescale Timer 0 Interrupt Interval /64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_6</name>
                  <value>6</value>
                  <description>RTC Prescale Timer 0 Interrupt Interval /128</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_7</name>
                  <value>7</value>
                  <description>RTC Prescale Timer 0 Interrupt Interval /256</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCPS1CTL</name>
          <addressOffset>0x04AA</addressOffset>
          <size>16</size>
          <description>Real Timer Prescale Timer 1 Control</description>
          <fields>
            <field>
              <name>RT1PSIFG</name>
              <description>[0:0] RTC Prescale Timer 1 Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>RT1PSIE</name>
              <description>[1:1] RTC Prescale Timer 1 Interrupt Enable Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RT1IP</name>
              <description>[4:2] RTC Prescale Timer 1 Interrupt Interval Bit: 2</description>
              <bitWidth>3</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT1IP_0</name>
                  <value>0</value>
                  <description>RTC Prescale Timer 1 Interrupt Interval /2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_1</name>
                  <value>1</value>
                  <description>RTC Prescale Timer 1 Interrupt Interval /4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_2</name>
                  <value>2</value>
                  <description>RTC Prescale Timer 1 Interrupt Interval /8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_3</name>
                  <value>3</value>
                  <description>RTC Prescale Timer 1 Interrupt Interval /16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_4</name>
                  <value>4</value>
                  <description>RTC Prescale Timer 1 Interrupt Interval /32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_5</name>
                  <value>5</value>
                  <description>RTC Prescale Timer 1 Interrupt Interval /64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_6</name>
                  <value>6</value>
                  <description>RTC Prescale Timer 1 Interrupt Interval /128</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_7</name>
                  <value>7</value>
                  <description>RTC Prescale Timer 1 Interrupt Interval /256</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCPS</name>
          <addressOffset>0x04AC</addressOffset>
          <size>16</size>
          <description>Real Timer Prescale Timer Control</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCIV</name>
          <addressOffset>0x04AE</addressOffset>
          <size>16</size>
          <description>Real Time Clock Interrupt Vector</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCTIM0</name>
          <addressOffset>0x04B0</addressOffset>
          <size>16</size>
          <description>Real Time Clock Time 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCTIM1</name>
          <addressOffset>0x04B2</addressOffset>
          <size>16</size>
          <description>Real Time Clock Time 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCDATE</name>
          <addressOffset>0x04B4</addressOffset>
          <size>16</size>
          <description>Real Time Clock Date</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCYEAR</name>
          <addressOffset>0x04B6</addressOffset>
          <size>16</size>
          <description>Real Time Clock Year</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCAMINHR</name>
          <addressOffset>0x04B8</addressOffset>
          <size>16</size>
          <description>Real Time Clock Alarm Min/Hour</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCADOWDAY</name>
          <addressOffset>0x04BA</addressOffset>
          <size>16</size>
          <description>Real Time Clock Alarm day of week/day</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BIN2BCD</name>
          <addressOffset>0x04BC</addressOffset>
          <size>16</size>
          <description>Real Time Binary-to-BCD conversion register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BCD2BIN</name>
          <addressOffset>0x04BE</addressOffset>
          <size>16</size>
          <description>Real Time BCD-to-binary conversion register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCSEC</name>
          <addressOffset>0x04B0</addressOffset>
          <size>8</size>
          <description>Real Time Clock Seconds</description>
          <fields>
            <field>
              <name>SECONDS0</name>
              <description>[0:0] Real Time Clock Seconds Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>SECONDS1</name>
              <description>[1:1] Real Time Clock Seconds Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SECONDS2</name>
              <description>[2:2] Real Time Clock Seconds Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SECONDS3</name>
              <description>[3:3] Real Time Clock Seconds Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SECONDS4</name>
              <description>[4:4] Real Time Clock Seconds Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SECONDS5</name>
              <description>[5:5] Real Time Clock Seconds Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>SECONDS6</name>
              <description>[6:6] Real Time Clock Seconds Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCMIN</name>
          <addressOffset>0x04B1</addressOffset>
          <size>8</size>
          <description>Real Time Clock Minutes</description>
          <fields>
            <field>
              <name>MINUTES0</name>
              <description>[0:0] Real Time Clock Minutes Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MINUTES1</name>
              <description>[1:1] Real Time Clock Minutes Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MINUTES2</name>
              <description>[2:2] Real Time Clock Minutes Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MINUTES3</name>
              <description>[3:3] Real Time Clock Minutes Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MINUTES4</name>
              <description>[4:4] Real Time Clock Minutes Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MINUTES5</name>
              <description>[5:5] Real Time Clock Minutes Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MINUTES6</name>
              <description>[6:6] Real Time Clock Minutes Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
