MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>RTCHOUR</name>
          <addressOffset>0x04B2</addressOffset>
          <size>8</size>
          <description>Real Time Clock Hour</description>
          <fields>
            <field>
              <name>HOUR0</name>
              <description>[0:0] Real Time Clock Hour Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>HOUR1</name>
              <description>[1:1] Real Time Clock Hour Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>HOUR2</name>
              <description>[2:2] Real Time Clock Hour Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>HOUR3</name>
              <description>[3:3] Real Time Clock Hour Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>HOUR4</name>
              <description>[4:4] Real Time Clock Hour Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>HOUR5</name>
              <description>[5:5] Real Time Clock Hour Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>HOUR6</name>
              <description>[6:6] Real Time Clock Hour Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCDOW</name>
          <addressOffset>0x04B3</addressOffset>
          <size>8</size>
          <description>Real Time Clock Day of week</description>
          <fields>
            <field>
              <name>DOW0</name>
              <description>[0:0] Real Time Clock DOW Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DOW1</name>
              <description>[1:1] Real Time Clock DOW Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DOW2</name>
              <description>[2:2] Real Time Clock DOW Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DOW3</name>
              <description>[3:3] Real Time Clock DOW Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DOW4</name>
              <description>[4:4] Real Time Clock DOW Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DOW5</name>
              <description>[5:5] Real Time Clock DOW Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DOW6</name>
              <description>[6:6] Real Time Clock DOW Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCDAY</name>
          <addressOffset>0x04B4</addressOffset>
          <size>8</size>
          <description>Real Time Clock Day</description>
          <fields>
            <field>
              <name>DAY0</name>
              <description>[0:0] Real Time Clock Day Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DAY1</name>
              <description>[1:1] Real Time Clock Day Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DAY2</name>
              <description>[2:2] Real Time Clock Day Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DAY3</name>
              <description>[3:3] Real Time Clock Day Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DAY4</name>
              <description>[4:4] Real Time Clock Day Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DAY5</name>
              <description>[5:5] Real Time Clock Day Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DAY6</name>
              <description>[6:6] Real Time Clock Day Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCMON</name>
          <addressOffset>0x04B5</addressOffset>
          <size>8</size>
          <description>Real Time Clock Month</description>
          <fields>
            <field>
              <name>MONTH0</name>
              <description>[0:0] Real Time Clock Month Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MONTH1</name>
              <description>[1:1] Real Time Clock Month Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MONTH2</name>
              <description>[2:2] Real Time Clock Month Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MONTH3</name>
              <description>[3:3] Real Time Clock Month Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MONTH4</name>
              <description>[4:4] Real Time Clock Month Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MONTH5</name>
              <description>[5:5] Real Time Clock Month Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MONTH6</name>
              <description>[6:6] Real Time Clock Month Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCAMIN</name>
          <addressOffset>0x04B8</addressOffset>
          <size>8</size>
          <description>Real Time Clock Alarm Min</description>
          <fields>
            <field>
              <name>MINUTES0</name>
              <description>[0:0] Real Time Clock Minutes Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>MINUTES1</name>
              <description>[1:1] Real Time Clock Minutes Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MINUTES2</name>
              <description>[2:2] Real Time Clock Minutes Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MINUTES3</name>
              <description>[3:3] Real Time Clock Minutes Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MINUTES4</name>
              <description>[4:4] Real Time Clock Minutes Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MINUTES5</name>
              <description>[5:5] Real Time Clock Minutes Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MINUTES6</name>
              <description>[6:6] Real Time Clock Minutes Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RTCAE</name>
              <description>[7:7] Real Time Clock Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCAHOUR</name>
          <addressOffset>0x04B9</addressOffset>
          <size>8</size>
          <description>Real Time Clock Alarm Hour</description>
          <fields>
            <field>
              <name>HOUR0</name>
              <description>[0:0] Real Time Clock Hour Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>HOUR1</name>
              <description>[1:1] Real Time Clock Hour Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>HOUR2</name>
              <description>[2:2] Real Time Clock Hour Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>HOUR3</name>
              <description>[3:3] Real Time Clock Hour Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>HOUR4</name>
              <description>[4:4] Real Time Clock Hour Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>HOUR5</name>
              <description>[5:5] Real Time Clock Hour Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>HOUR6</name>
              <description>[6:6] Real Time Clock Hour Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RTCAE</name>
              <description>[7:7] Real Time Clock Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCADOW</name>
          <addressOffset>0x04BA</addressOffset>
          <size>8</size>
          <description>Real Time Clock Alarm Day of week</description>
          <fields>
            <field>
              <name>DOW0</name>
              <description>[0:0] Real Time Clock DOW Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DOW1</name>
              <description>[1:1] Real Time Clock DOW Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DOW2</name>
              <description>[2:2] Real Time Clock DOW Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DOW3</name>
              <description>[3:3] Real Time Clock DOW Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DOW4</name>
              <description>[4:4] Real Time Clock DOW Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DOW5</name>
              <description>[5:5] Real Time Clock DOW Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DOW6</name>
              <description>[6:6] Real Time Clock DOW Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RTCAE</name>
              <description>[7:7] Real Time Clock Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCADAY</name>
          <addressOffset>0x04BB</addressOffset>
          <size>8</size>
          <description>Real Time Clock Alarm Day</description>
          <fields>
            <field>
              <name>DAY0</name>
              <description>[0:0] Real Time Clock Day Bit: 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>DAY1</name>
              <description>[1:1] Real Time Clock Day Bit: 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DAY2</name>
              <description>[2:2] Real Time Clock Day Bit: 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DAY3</name>
              <description>[3:3] Real Time Clock Day Bit: 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DAY4</name>
              <description>[4:4] Real Time Clock Day Bit: 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DAY5</name>
              <description>[5:5] Real Time Clock Day Bit: 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>DAY6</name>
              <description>[6:6] Real Time Clock Day Bit: 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RTCAE</name>
              <description>[7:7] Real Time Clock Alarm enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
