MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SFR__Special_Function_Registers</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>SFR  Special Function Registers</description>
      <registers>
        <register>
          <name>SFRIE1</name>
          <addressOffset>0x0100</addressOffset>
          <size>16</size>
          <description>Interrupt Enable 1</description>
          <fields>
            <field>
              <name>WDTIE</name>
              <description>[0:0] WDT Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>OFIE</name>
              <description>[1:1] Osc Fault Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>VMAIE</name>
              <description>[3:3] Vacant Memory Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>NMIIE</name>
              <description>[4:4] NMI Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>JMBINIE</name>
              <description>[6:6] JTAG Mail Box input Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>JMBOUTIE</name>
              <description>[7:7] JTAG Mail Box output Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SFRIFG1</name>
          <addressOffset>0x0102</addressOffset>
          <size>16</size>
          <description>Interrupt Flag 1</description>
          <fields>
            <field>
              <name>WDTIFG</name>
              <description>[0:0] WDT Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>OFIFG</name>
              <description>[1:1] Osc Fault Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>VMAIFG</name>
              <description>[3:3] Vacant Memory Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>NMIIFG</name>
              <description>[4:4] NMI Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>JMBINIFG</name>
              <description>[6:6] JTAG Mail Box input Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>JMBOUTIFG</name>
              <description>[7:7] JTAG Mail Box output Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SFRRPCR</name>
          <addressOffset>0x0104</addressOffset>
          <size>16</size>
          <description>RESET Pin Control Register</description>
          <fields>
            <field>
              <name>SYSNMI</name>
              <description>[0:0] NMI select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>SYSNMIIES</name>
              <description>[1:1] NMI edge select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SYSRSTUP</name>
              <description>[2:2] RESET Pin pull down/up select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SYSRSTRE</name>
              <description>[3:3] RESET Pin Resistor enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS__System_Module</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>SYS  System Module</description>
      <registers>
        <register>
          <name>SYSCTL</name>
          <addressOffset>0x0180</addressOffset>
          <size>16</size>
          <description>System control</description>
          <fields>
            <field>
              <name>SYSRIVECT</name>
              <description>[0:0] SYS - RAM based interrupt vectors</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>SYSPMMPE</name>
              <description>[2:2] SYS - PMM access protect</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SYSBSLIND</name>
              <description>[4:4] SYS - TCK/RST indication detected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SYSJTAGPIN</name>
              <description>[5:5] SYS - Dedicated JTAG pins enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SYSBSLC</name>
          <addressOffset>0x0182</addressOffset>
          <size>16</size>
          <description>Boot strap configuration area</description>
          <fields>
            <field>
              <name>SYSBSLSIZE0</name>
              <description>[0:0] SYS - BSL Protection Size 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>SYSBSLSIZE1</name>
              <description>[1:1] SYS - BSL Protection Size 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SYSBSLR</name>
              <description>[2:2] SYS - RAM assigned to BSL</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SYSBSLOFF</name>
              <description>[14:14] SYS - BSL Memory disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>SYSBSLPE</name>
              <description>[15:15] SYS - BSL Memory protection enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SYSJMBC</name>
          <addressOffset>0x0186</addressOffset>
          <size>16</size>
          <description>JTAG mailbox control</description>
          <fields>
            <field>
              <name>JMBIN0FG</name>
              <description>[0:0] SYS - Incoming JTAG Mailbox 0 Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>JMBIN1FG</name>
              <description>[1:1] SYS - Incoming JTAG Mailbox 1 Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>JMBOUT0FG</name>
              <description>[2:2] SYS - Outgoing JTAG Mailbox 0 Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>JMBOUT1FG</name>
              <description>[3:3] SYS - Outgoing JTAG Mailbox 1 Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>JMBMODE</name>
              <description>[4:4] SYS - JMB 16/32 Bit Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>JMBCLR0OFF</name>
              <description>[6:6] SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>JMBCLR1OFF</name>
              <description>[7:7] SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SYSJMBI0</name>
          <addressOffset>0x0188</addressOffset>
          <size>16</size>
          <description>JTAG mailbox input 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSJMBI1</name>
          <addressOffset>0x018A</addressOffset>
          <size>16</size>
          <description>JTAG mailbox input 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSJMBO0</name>
          <addressOffset>0x018C</addressOffset>
          <size>16</size>
          <description>JTAG mailbox output 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSJMBO1</name>
          <addressOffset>0x018E</addressOffset>
          <size>16</size>
          <description>JTAG mailbox output 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSBERRIV</name>
          <addressOffset>0x0198</addressOffset>
          <size>16</size>
          <description>Bus Error vector generator</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSUNIV</name>
          <addressOffset>0x019A</addressOffset>
          <size>16</size>
          <description>User NMI vector generator</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSSNIV</name>
          <addressOffset>0x019C</addressOffset>
          <size>16</size>
          <description>System NMI vector generator</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSRSTIV</name>
          <addressOffset>0x019E</addressOffset>
          <size>16</size>
          <description>Reset vector generator</description>
          <resetValue>0</resetValue>
        </register>
