MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>TB1CCTL2</name>
          <addressOffset>0x0406</addressOffset>
          <size>16</size>
          <description>Timer1_B3 Capture/Compare Control 2</description>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>[0:0] Capture/compare interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>COV</name>
              <description>[1:1] Capture/compare overflow flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>OUT</name>
              <description>[2:2] PWM Output signal if output mode 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CCI</name>
              <description>[3:3] Capture input signal (read)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CCIE</name>
              <description>[4:4] Capture/compare interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>[7:5] Output mode 2</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <value>0</value>
                  <description>PWM output mode: 0 - output only</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <value>1</value>
                  <description>PWM output mode: 1 - set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <value>2</value>
                  <description>PWM output mode: 2 - PWM toggle/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <value>3</value>
                  <description>PWM output mode: 3 - PWM set/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <value>4</value>
                  <description>PWM output mode: 4 - toggle</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <value>5</value>
                  <description>PWM output mode: 5 - Reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <value>6</value>
                  <description>PWM output mode: 6 - PWM toggle/set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <value>7</value>
                  <description>PWM output mode: 7 - PWM reset/set</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>[8:8] Capture mode: 1 /Compare mode : 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CLLD</name>
              <description>[10:9] Compare latch load source 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <value>0</value>
                  <description>Compare latch load sourec : 0 - immediate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <value>1</value>
                  <description>Compare latch load sourec : 1 - TBR counts to 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <value>2</value>
                  <description>Compare latch load sourec : 2 - up/down</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <value>3</value>
                  <description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>[11:11] Capture sychronize</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CCIS</name>
              <description>[13:12] Capture input select 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIS_0</name>
                  <value>0</value>
                  <description>Capture input select: 0 - CCIxA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_1</name>
                  <value>1</value>
                  <description>Capture input select: 1 - CCIxB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_2</name>
                  <value>2</value>
                  <description>Capture input select: 2 - GND</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_3</name>
                  <value>3</value>
                  <description>Capture input select: 3 - Vcc</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>[15:14] Capture mode 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <value>0</value>
                  <description>Capture mode: 0 - disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <value>1</value>
                  <description>Capture mode: 1 - pos. edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <value>2</value>
                  <description>Capture mode: 1 - neg. edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <value>3</value>
                  <description>Capture mode: 1 - both edges</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TB1R</name>
          <addressOffset>0x0410</addressOffset>
          <size>16</size>
          <description>Timer1_B3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TB1CCR0</name>
          <addressOffset>0x0412</addressOffset>
          <size>16</size>
          <description>Timer1_B3 Capture/Compare 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TB1CCR1</name>
          <addressOffset>0x0414</addressOffset>
          <size>16</size>
          <description>Timer1_B3 Capture/Compare 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TB1CCR2</name>
          <addressOffset>0x0416</addressOffset>
          <size>16</size>
          <description>Timer1_B3 Capture/Compare 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TB1IV</name>
          <addressOffset>0x042E</addressOffset>
          <size>16</size>
          <description>Timer1_B3 Interrupt Vector Word</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TB1EX0</name>
          <addressOffset>0x0420</addressOffset>
          <size>16</size>
          <description>Timer1_B3 Expansion Register 0</description>
          <fields>
            <field>
              <name>TBIDEX</name>
              <description>[2:0] Timer0_B7 Input divider expansion Bit: 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBIDEX_0</name>
                  <value>0</value>
                  <description>Timer0_B7 Input divider expansion : /1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_1</name>
                  <value>1</value>
                  <description>Timer0_B7 Input divider expansion : /2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_2</name>
                  <value>2</value>
                  <description>Timer0_B7 Input divider expansion : /3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_3</name>
                  <value>3</value>
                  <description>Timer0_B7 Input divider expansion : /4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_4</name>
                  <value>4</value>
                  <description>Timer0_B7 Input divider expansion : /5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_5</name>
                  <value>5</value>
                  <description>Timer0_B7 Input divider expansion : /6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_6</name>
                  <value>6</value>
                  <description>Timer0_B7 Input divider expansion : /7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_7</name>
                  <value>7</value>
                  <description>Timer0_B7 Input divider expansion : /8</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
