MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Timer2_B3</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Timer2_B3</description>
      <registers>
        <register>
          <name>TB2CTL</name>
          <addressOffset>0x0440</addressOffset>
          <size>16</size>
          <description>Timer2_B3 Control</description>
          <fields>
            <field>
              <name>TBIFG</name>
              <description>[0:0] Timer0_B7 interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>TBIE</name>
              <description>[1:1] Timer0_B7 interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TBCLR</name>
              <description>[2:2] Timer0_B7 counter clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MC</name>
              <description>[5:4] Timer0_B7 mode control 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MC_0</name>
                  <value>0</value>
                  <description>Timer A mode control: 0 - Stop</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MC_1</name>
                  <value>1</value>
                  <description>Timer A mode control: 1 - Up to CCR0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MC_2</name>
                  <value>2</value>
                  <description>Timer A mode control: 2 - Continuous up</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MC_3</name>
                  <value>3</value>
                  <description>Timer A mode control: 3 - Up/Down</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID</name>
              <description>[7:6] Timer0_B7 clock input divider 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID_0</name>
                  <value>0</value>
                  <description>Timer A input divider: 0 - /1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_1</name>
                  <value>1</value>
                  <description>Timer A input divider: 1 - /2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_2</name>
                  <value>2</value>
                  <description>Timer A input divider: 2 - /4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_3</name>
                  <value>3</value>
                  <description>Timer A input divider: 3 - /8</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBSSEL</name>
              <description>[9:8] Clock source 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBSSEL_0</name>
                  <value>0</value>
                  <description>Clock Source: TBCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBSSEL_1</name>
                  <value>1</value>
                  <description>Clock Source: ACLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBSSEL_2</name>
                  <value>2</value>
                  <description>Clock Source: SMCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBSSEL_3</name>
                  <value>3</value>
                  <description>Clock Source: INCLK</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTL</name>
              <description>[12:11] Counter lenght 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNTL_0</name>
                  <value>0</value>
                  <description>Counter lenght: 16 bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTL_1</name>
                  <value>1</value>
                  <description>Counter lenght: 12 bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTL_2</name>
                  <value>2</value>
                  <description>Counter lenght: 10 bit</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTL_3</name>
                  <value>3</value>
                  <description>Counter lenght:  8 bit</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCLGRP</name>
              <description>[14:13] Timer0_B7 Compare latch load group 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBCLGRP_0</name>
                  <value>0</value>
                  <description>Timer0_B7 Group: 0 - individually</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_1</name>
                  <value>1</value>
                  <description>Timer0_B7 Group: 1 - 3 groups (1-2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_2</name>
                  <value>2</value>
                  <description>Timer0_B7 Group: 2 - 2 groups (1-3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_3</name>
                  <value>3</value>
                  <description>Timer0_B7 Group: 3 - 1 group (all)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TB2CCTL0</name>
          <addressOffset>0x0442</addressOffset>
          <size>16</size>
          <description>Timer2_B3 Capture/Compare Control 0</description>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>[0:0] Capture/compare interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>COV</name>
              <description>[1:1] Capture/compare overflow flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>OUT</name>
              <description>[2:2] PWM Output signal if output mode 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CCI</name>
              <description>[3:3] Capture input signal (read)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CCIE</name>
              <description>[4:4] Capture/compare interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>[7:5] Output mode 2</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <value>0</value>
                  <description>PWM output mode: 0 - output only</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <value>1</value>
                  <description>PWM output mode: 1 - set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <value>2</value>
                  <description>PWM output mode: 2 - PWM toggle/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <value>3</value>
                  <description>PWM output mode: 3 - PWM set/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <value>4</value>
                  <description>PWM output mode: 4 - toggle</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <value>5</value>
                  <description>PWM output mode: 5 - Reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <value>6</value>
                  <description>PWM output mode: 6 - PWM toggle/set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <value>7</value>
                  <description>PWM output mode: 7 - PWM reset/set</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>[8:8] Capture mode: 1 /Compare mode : 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CLLD</name>
              <description>[10:9] Compare latch load source 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <value>0</value>
                  <description>Compare latch load sourec : 0 - immediate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <value>1</value>
                  <description>Compare latch load sourec : 1 - TBR counts to 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <value>2</value>
                  <description>Compare latch load sourec : 2 - up/down</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <value>3</value>
                  <description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>[11:11] Capture sychronize</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CCIS</name>
              <description>[13:12] Capture input select 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIS_0</name>
                  <value>0</value>
                  <description>Capture input select: 0 - CCIxA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_1</name>
                  <value>1</value>
                  <description>Capture input select: 1 - CCIxB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_2</name>
                  <value>2</value>
                  <description>Capture input select: 2 - GND</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_3</name>
                  <value>3</value>
                  <description>Capture input select: 3 - Vcc</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>[15:14] Capture mode 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <value>0</value>
                  <description>Capture mode: 0 - disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <value>1</value>
                  <description>Capture mode: 1 - pos. edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <value>2</value>
                  <description>Capture mode: 1 - neg. edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <value>3</value>
                  <description>Capture mode: 1 - both edges</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TB2CCTL1</name>
          <addressOffset>0x0444</addressOffset>
          <size>16</size>
          <description>Timer2_B3 Capture/Compare Control 1</description>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>[0:0] Capture/compare interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>COV</name>
              <description>[1:1] Capture/compare overflow flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>OUT</name>
              <description>[2:2] PWM Output signal if output mode 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CCI</name>
              <description>[3:3] Capture input signal (read)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CCIE</name>
              <description>[4:4] Capture/compare interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>[7:5] Output mode 2</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <value>0</value>
                  <description>PWM output mode: 0 - output only</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <value>1</value>
                  <description>PWM output mode: 1 - set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <value>2</value>
                  <description>PWM output mode: 2 - PWM toggle/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <value>3</value>
                  <description>PWM output mode: 3 - PWM set/reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <value>4</value>
                  <description>PWM output mode: 4 - toggle</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <value>5</value>
                  <description>PWM output mode: 5 - Reset</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <value>6</value>
                  <description>PWM output mode: 6 - PWM toggle/set</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <value>7</value>
                  <description>PWM output mode: 7 - PWM reset/set</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>[8:8] Capture mode: 1 /Compare mode : 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CLLD</name>
              <description>[10:9] Compare latch load source 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <value>0</value>
                  <description>Compare latch load sourec : 0 - immediate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <value>1</value>
                  <description>Compare latch load sourec : 1 - TBR counts to 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <value>2</value>
                  <description>Compare latch load sourec : 2 - up/down</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <value>3</value>
                  <description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>[11:11] Capture sychronize</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CCIS</name>
              <description>[13:12] Capture input select 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIS_0</name>
                  <value>0</value>
                  <description>Capture input select: 0 - CCIxA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_1</name>
                  <value>1</value>
                  <description>Capture input select: 1 - CCIxB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_2</name>
                  <value>2</value>
                  <description>Capture input select: 2 - GND</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_3</name>
                  <value>3</value>
                  <description>Capture input select: 3 - Vcc</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>[15:14] Capture mode 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <value>0</value>
                  <description>Capture mode: 0 - disabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <value>1</value>
                  <description>Capture mode: 1 - pos. edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <value>2</value>
                  <description>Capture mode: 1 - neg. edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <value>3</value>
                  <description>Capture mode: 1 - both edges</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
