MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USCI_A0__UART_Mode</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>USCI_A0  UART Mode</description>
      <registers>
        <register>
          <name>UCA0CTLW0</name>
          <addressOffset>0x05C0</addressOffset>
          <size>16</size>
          <description>USCI A0 Control Word Register 0</description>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>[0:0] USCI Software Reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCTXBRK</name>
              <description>[1:1] Send next Data as Break</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCTXADDR</name>
              <description>[2:2] Send next Data as Address</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCDORM</name>
              <description>[3:3] Dormant (Sleep) Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCBRKIE</name>
              <description>[4:4] Break interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCRXEIE</name>
              <description>[5:5] RX Error interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>[7:6] USCI 0 Clock Source Select 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSSEL_0</name>
                  <value>0</value>
                  <description>USCI 0 Clock Source: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_1</name>
                  <value>1</value>
                  <description>USCI 0 Clock Source: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_2</name>
                  <value>2</value>
                  <description>USCI 0 Clock Source: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_3</name>
                  <value>3</value>
                  <description>USCI 0 Clock Source: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSYNC</name>
              <description>[8:8] Sync-Mode  0:UART-Mode / 1:SPI-Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCMODE</name>
              <description>[10:9] Async. Mode: USCI Mode 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <value>0</value>
                  <description>Sync. Mode: USCI Mode: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <value>1</value>
                  <description>Sync. Mode: USCI Mode: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <value>2</value>
                  <description>Sync. Mode: USCI Mode: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_3</name>
                  <value>3</value>
                  <description>Sync. Mode: USCI Mode: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSPB</name>
              <description>[11:11] Async. Mode: Stop Bits  0:one / 1: two</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>UC7BIT</name>
              <description>[12:12] Async. Mode: Data Bits  0:8-bits / 1:7-bits</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>UCMSB</name>
              <description>[13:13] Async. Mode: MSB first  0:LSB / 1:MSB</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>UCPAR</name>
              <description>[14:14] Async. Mode: Parity     0:odd / 1:even</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>UCPEN</name>
              <description>[15:15] Async. Mode: Parity enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0CTL0</name>
          <addressOffset>0x05C1</addressOffset>
          <size>8</size>
          <description>USCI A0 Control Register 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0CTL1</name>
          <addressOffset>0x05C0</addressOffset>
          <size>8</size>
          <description>USCI A0 Control Register 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0CTLW1</name>
          <addressOffset>0x05C2</addressOffset>
          <size>16</size>
          <description>USCI A0 Control Word Register 1</description>
          <fields>
            <field>
              <name>UCGLIT</name>
              <description>[1:0] USCI Deglitch Time Bit 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCGLIT_0</name>
                  <value>0</value>
                  <description>USCI Deglitch time: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_1</name>
                  <value>1</value>
                  <description>USCI Deglitch time: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_2</name>
                  <value>2</value>
                  <description>USCI Deglitch time: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_3</name>
                  <value>3</value>
                  <description>USCI Deglitch time: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0BRW</name>
          <addressOffset>0x05C6</addressOffset>
          <size>16</size>
          <description>USCI A0 Baud Word Rate 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0BR0</name>
          <addressOffset>0x05C6</addressOffset>
          <size>8</size>
          <description>USCI A0 Baud Rate 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0BR1</name>
          <addressOffset>0x05C7</addressOffset>
          <size>8</size>
          <description>USCI A0 Baud Rate 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0MCTLW</name>
          <addressOffset>0x05C8</addressOffset>
          <size>16</size>
          <description>USCI A0 Modulation Control</description>
          <fields>
            <field>
              <name>UCOS16</name>
              <description>[0:0] USCI 16-times Oversampling enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCBRF</name>
              <description>[7:4] USCI First Stage Modulation Select 3</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBRF_0</name>
                  <value>0</value>
                  <description>USCI First Stage Modulation: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_1</name>
                  <value>1</value>
                  <description>USCI First Stage Modulation: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_2</name>
                  <value>2</value>
                  <description>USCI First Stage Modulation: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_3</name>
                  <value>3</value>
                  <description>USCI First Stage Modulation: 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_4</name>
                  <value>4</value>
                  <description>USCI First Stage Modulation: 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_5</name>
                  <value>5</value>
                  <description>USCI First Stage Modulation: 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_6</name>
                  <value>6</value>
                  <description>USCI First Stage Modulation: 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_7</name>
                  <value>7</value>
                  <description>USCI First Stage Modulation: 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_8</name>
                  <value>8</value>
                  <description>USCI First Stage Modulation: 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_9</name>
                  <value>9</value>
                  <description>USCI First Stage Modulation: 9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_10</name>
                  <value>10</value>
                  <description>USCI First Stage Modulation: A</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_11</name>
                  <value>11</value>
                  <description>USCI First Stage Modulation: B</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_12</name>
                  <value>12</value>
                  <description>USCI First Stage Modulation: C</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_13</name>
                  <value>13</value>
                  <description>USCI First Stage Modulation: D</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_14</name>
                  <value>14</value>
                  <description>USCI First Stage Modulation: E</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_15</name>
                  <value>15</value>
                  <description>USCI First Stage Modulation: F</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBRS0</name>
              <description>[8:8] USCI Second Stage Modulation Select 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCBRS1</name>
              <description>[9:9] USCI Second Stage Modulation Select 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UCBRS2</name>
              <description>[10:10] USCI Second Stage Modulation Select 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>UCBRS3</name>
              <description>[11:11] USCI Second Stage Modulation Select 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>UCBRS4</name>
              <description>[12:12] USCI Second Stage Modulation Select 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>UCBRS5</name>
              <description>[13:13] USCI Second Stage Modulation Select 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>UCBRS6</name>
              <description>[14:14] USCI Second Stage Modulation Select 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>UCBRS7</name>
              <description>[15:15] USCI Second Stage Modulation Select 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0STATW</name>
          <addressOffset>0x05CA</addressOffset>
          <size>8</size>
          <description>USCI A0 Status Register</description>
          <fields>
            <field>
              <name>UCBUSY</name>
              <description>[0:0] USCI Busy Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCADDR</name>
              <description>[1:1] USCI Address received Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCRXERR</name>
              <description>[2:2] USCI RX Error Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCBRK</name>
              <description>[3:3] USCI Break received</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCPE</name>
              <description>[4:4] USCI Parity Error Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCOE</name>
              <description>[5:5] USCI Overrun Error Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCFE</name>
              <description>[6:6] USCI Frame Error Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>[7:7] USCI Listen mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0RXBUF</name>
          <addressOffset>0x05CC</addressOffset>
          <size>16</size>
          <description>USCI A0 Receive Buffer</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0TXBUF</name>
          <addressOffset>0x05CE</addressOffset>
          <size>16</size>
          <description>USCI A0 Transmit Buffer</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0ABCTL</name>
          <addressOffset>0x05D0</addressOffset>
          <size>8</size>
          <description>USCI A0 LIN Control</description>
          <fields>
            <field>
              <name>UCABDEN</name>
              <description>[0:0] Auto Baud Rate detect enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCBTOE</name>
              <description>[2:2] Break Timeout error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCSTOE</name>
              <description>[3:3] Sync-Field Timeout error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCDELIM0</name>
              <description>[4:4] Break Sync Delimiter 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCDELIM1</name>
              <description>[5:5] Break Sync Delimiter 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0IRCTL</name>
          <addressOffset>0x05D2</addressOffset>
          <size>16</size>
          <description>USCI A0 IrDA Transmit Control</description>
          <fields>
            <field>
              <name>UCIREN</name>
              <description>[0:0] IRDA Encoder/Decoder enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCIRTXCLK</name>
              <description>[1:1] IRDA Transmit Pulse Clock Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCIRTXPL0</name>
              <description>[2:2] IRDA Transmit Pulse Length 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCIRTXPL1</name>
              <description>[3:3] IRDA Transmit Pulse Length 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCIRTXPL2</name>
              <description>[4:4] IRDA Transmit Pulse Length 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCIRTXPL3</name>
              <description>[5:5] IRDA Transmit Pulse Length 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCIRTXPL4</name>
              <description>[6:6] IRDA Transmit Pulse Length 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCIRTXPL5</name>
              <description>[7:7] IRDA Transmit Pulse Length 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCIRRXFE</name>
              <description>[8:8] IRDA Receive Filter enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCIRRXPL</name>
              <description>[9:9] IRDA Receive Input Polarity</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UCIRRXFL0</name>
              <description>[10:10] IRDA Receive Filter Length 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>UCIRRXFL1</name>
              <description>[11:11] IRDA Receive Filter Length 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>UCIRRXFL2</name>
              <description>[12:12] IRDA Receive Filter Length 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>UCIRRXFL3</name>
              <description>[13:13] IRDA Receive Filter Length 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>UCIRRXFL4</name>
              <description>[14:14] IRDA Receive Filter Length 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>UCIRRXFL5</name>
              <description>[15:15] IRDA Receive Filter Length 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0IRTCTL</name>
          <addressOffset>0x05D2</addressOffset>
          <size>8</size>
          <description>USCI A0 IrDA Transmit Control</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0IRRCTL</name>
          <addressOffset>0x05D3</addressOffset>
          <size>8</size>
          <description>USCI A0 IrDA Receive Control</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0IE</name>
          <addressOffset>0x05DA</addressOffset>
          <size>16</size>
          <description>USCI A0 Interrupt Enable Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0IFG</name>
          <addressOffset>0x05DC</addressOffset>
          <size>16</size>
          <description>USCI A0 Interrupt Flags Register</description>
          <resetValue>0</resetValue>
        </register>
