MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>UCA0IE__UART</name>
          <addressOffset>0x05DA</addressOffset>
          <size>16</size>
          <description>USCI A0 Interrupt Enable Register</description>
          <fields>
            <field>
              <name>UCRXIE</name>
              <description>[0:0] UART Receive Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCTXIE</name>
              <description>[1:1] UART Transmit Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCSTTIE</name>
              <description>[2:2] UART Start Bit Interrupt Enalble</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCTXCPTIE</name>
              <description>[3:3] UART Transmit Complete Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0IFG__UART</name>
          <addressOffset>0x05DC</addressOffset>
          <size>16</size>
          <description>USCI A0 Interrupt Flags Register</description>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>[0:0] UART Receive Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>[1:1] UART Transmit Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCSTTIFG</name>
              <description>[2:2] UART Start Bit Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCTXCPTIFG</name>
              <description>[3:3] UART Transmit Complete Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0IV</name>
          <addressOffset>0x05DE</addressOffset>
          <size>16</size>
          <description>USCI A0 Interrupt Vector Register</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USCI_A0__SPI_Mode</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>USCI_A0  SPI Mode</description>
      <registers>
        <register>
          <name>UCA0CTLW0__SPI</name>
          <addressOffset>0x05C0</addressOffset>
          <size>16</size>
          <description>USCI A0 Control Word Register 0</description>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>[0:0] USCI Software Reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCSTEM</name>
              <description>[1:1] USCI STE Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>[7:6] USCI 1 Clock Source Select 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSSEL_0</name>
                  <value>0</value>
                  <description>USCI 0 Clock Source: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_1</name>
                  <value>1</value>
                  <description>USCI 0 Clock Source: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_2</name>
                  <value>2</value>
                  <description>USCI 0 Clock Source: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_3</name>
                  <value>3</value>
                  <description>USCI 0 Clock Source: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSYNC</name>
              <description>[8:8] Sync-Mode  0:UART-Mode / 1:SPI-Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCMODE</name>
              <description>[10:9] Sync. Mode: USCI Mode 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <value>0</value>
                  <description>Sync. Mode: USCI Mode: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <value>1</value>
                  <description>Sync. Mode: USCI Mode: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <value>2</value>
                  <description>Sync. Mode: USCI Mode: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_3</name>
                  <value>3</value>
                  <description>Sync. Mode: USCI Mode: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMST</name>
              <description>[11:11] Sync. Mode: Master Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>UC7BIT</name>
              <description>[12:12] Sync. Mode: Data Bits 0:8-bits / 1:7-bits</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>UCMSB</name>
              <description>[13:13] Sync. Mode: MSB first 0:LSB / 1:MSB</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>UCCKPL</name>
              <description>[14:14] Sync. Mode: Clock Polarity</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>UCCKPH</name>
              <description>[15:15] Sync. Mode: Clock Phase</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0CTL0__SPI</name>
          <addressOffset>0x05C1</addressOffset>
          <size>8</size>
          <description>USCI A0 Control Register 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0CTL1__SPI</name>
          <addressOffset>0x05C0</addressOffset>
          <size>8</size>
          <description>USCI A0 Control Register 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0BRW__SPI</name>
          <addressOffset>0x05C6</addressOffset>
          <size>16</size>
          <description>USCI A0 Baud Word Rate 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0BR0__SPI</name>
          <addressOffset>0x05C6</addressOffset>
          <size>8</size>
          <description>USCI A0 Baud Rate 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0BR1__SPI</name>
          <addressOffset>0x05C7</addressOffset>
          <size>8</size>
          <description>USCI A0 Baud Rate 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0STATW__SPI</name>
          <addressOffset>0x05CA</addressOffset>
          <size>8</size>
          <description>USCI A0 Status Register</description>
          <fields>
            <field>
              <name>UCBUSY</name>
              <description>[0:0] USCI Busy Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCOE</name>
              <description>[5:5] USCI Overrun Error Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCFE</name>
              <description>[6:6] USCI Frame Error Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>[7:7] USCI Listen mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0RXBUF__SPI</name>
          <addressOffset>0x05CC</addressOffset>
          <size>16</size>
          <description>USCI A0 Receive Buffer</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0TXBUF__SPI</name>
          <addressOffset>0x05CE</addressOffset>
          <size>16</size>
          <description>USCI A0 Transmit Buffer</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCA0IE__SPI</name>
          <addressOffset>0x05DA</addressOffset>
          <size>8</size>
          <description>USCI A0 Interrupt Enable Register</description>
          <fields>
            <field>
              <name>UCRXIE</name>
              <description>[0:0] USCI Receive Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCTXIE</name>
              <description>[1:1] USCI Transmit Interrupt Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0IFG__SPI</name>
          <addressOffset>0x05DC</addressOffset>
          <size>8</size>
          <description>USCI A0 Interrupt Flags Register</description>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>[0:0] SPI Receive Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>[1:1] SPI Transmit Interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCA0IV__SPI</name>
          <addressOffset>0x05DE</addressOffset>
          <size>16</size>
          <description>USCI A0 Interrupt Vector Register</description>
          <resetValue>0</resetValue>
        </register>
