MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USCI_B0__I2C_Mode</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>USCI_B0  I2C Mode</description>
      <registers>
        <register>
          <name>UCB0CTLW0</name>
          <addressOffset>0x0640</addressOffset>
          <size>16</size>
          <description>USCI B0 Control Word Register 0</description>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>[0:0] USCI Software Reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCTXSTT</name>
              <description>[1:1] Transmit START</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCTXSTP</name>
              <description>[2:2] Transmit STOP</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCTXNACK</name>
              <description>[3:3] Transmit NACK</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCTR</name>
              <description>[4:4] Transmit/Receive Select/Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCTXACK</name>
              <description>[5:5] Transmit ACK</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>[7:6] USCI 1 Clock Source Select 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSSEL_0</name>
                  <value>0</value>
                  <description>USCI 0 Clock Source: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_1</name>
                  <value>1</value>
                  <description>USCI 0 Clock Source: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_2</name>
                  <value>2</value>
                  <description>USCI 0 Clock Source: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_3</name>
                  <value>3</value>
                  <description>USCI 0 Clock Source: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMODE</name>
              <description>[10:9] Sync. Mode: USCI Mode 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <value>0</value>
                  <description>Sync. Mode: USCI Mode: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <value>1</value>
                  <description>Sync. Mode: USCI Mode: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <value>2</value>
                  <description>Sync. Mode: USCI Mode: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_3</name>
                  <value>3</value>
                  <description>Sync. Mode: USCI Mode: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMST</name>
              <description>[11:11] Sync. Mode: Master Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>UCMM</name>
              <description>[13:13] Multi-Master Environment</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>UCSLA10</name>
              <description>[14:14] 10-bit Slave Address Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>UCA10</name>
              <description>[15:15] 10-bit Address Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0CTL0</name>
          <addressOffset>0x0641</addressOffset>
          <size>8</size>
          <description>USCI B0 Control Register 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0CTL1</name>
          <addressOffset>0x0640</addressOffset>
          <size>8</size>
          <description>USCI B0 Control Register 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0CTLW1</name>
          <addressOffset>0x0642</addressOffset>
          <size>16</size>
          <description>USCI B0 Control Word Register 1</description>
          <fields>
            <field>
              <name>UCGLIT</name>
              <description>[1:0] USCI Deglitch time Bit: 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCGLIT_0</name>
                  <value>0</value>
                  <description>USCI Deglitch time: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_1</name>
                  <value>1</value>
                  <description>USCI Deglitch time: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_2</name>
                  <value>2</value>
                  <description>USCI Deglitch time: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_3</name>
                  <value>3</value>
                  <description>USCI Deglitch time: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCASTP</name>
              <description>[3:2] USCI Automatic Stop condition generation Bit: 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCASTP_0</name>
                  <value>0</value>
                  <description>USCI Automatic Stop condition generation: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCASTP_1</name>
                  <value>1</value>
                  <description>USCI Automatic Stop condition generation: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCASTP_2</name>
                  <value>2</value>
                  <description>USCI Automatic Stop condition generation: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCASTP_3</name>
                  <value>3</value>
                  <description>USCI Automatic Stop condition generation: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSWACK</name>
              <description>[4:4] USCI Software controlled ACK</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCSTPNACK</name>
              <description>[5:5] USCI Acknowledge Stop last byte</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCCLTO</name>
              <description>[7:6] USCI Clock low timeout Bit: 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCCLTO_0</name>
                  <value>0</value>
                  <description>USCI Clock low timeout: 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTO_1</name>
                  <value>1</value>
                  <description>USCI Clock low timeout: 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTO_2</name>
                  <value>2</value>
                  <description>USCI Clock low timeout: 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCLTO_3</name>
                  <value>3</value>
                  <description>USCI Clock low timeout: 3</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCETXINT</name>
              <description>[8:8] USCI Early UCTXIFG0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0BRW</name>
          <addressOffset>0x0646</addressOffset>
          <size>16</size>
          <description>USCI B0 Baud Word Rate 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0BR0</name>
          <addressOffset>0x0646</addressOffset>
          <size>8</size>
          <description>USCI B0 Baud Rate 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0BR1</name>
          <addressOffset>0x0647</addressOffset>
          <size>8</size>
          <description>USCI B0 Baud Rate 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0STATW</name>
          <addressOffset>0x0648</addressOffset>
          <size>16</size>
          <description>USCI B0 Status Word Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0STATW__I2C</name>
          <addressOffset>0x0648</addressOffset>
          <size>16</size>
          <description>USCI B0 Status Register</description>
          <fields>
            <field>
              <name>UCBBUSY</name>
              <description>[4:4] Bus Busy Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCGC</name>
              <description>[5:5] General Call address received Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCSCLLOW</name>
              <description>[6:6] SCL low</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCBCNT0</name>
              <description>[8:8] USCI Byte Counter Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCBCNT1</name>
              <description>[9:9] USCI Byte Counter Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UCBCNT2</name>
              <description>[10:10] USCI Byte Counter Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>UCBCNT3</name>
              <description>[11:11] USCI Byte Counter Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>UCBCNT4</name>
              <description>[12:12] USCI Byte Counter Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>UCBCNT5</name>
              <description>[13:13] USCI Byte Counter Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>UCBCNT6</name>
              <description>[14:14] USCI Byte Counter Bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>UCBCNT7</name>
              <description>[15:15] USCI Byte Counter Bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0STAT__I2C</name>
          <addressOffset>0x0648</addressOffset>
          <size>8</size>
          <description>USCI B0 Status Register</description>
          <fields>
            <field>
              <name>UCBBUSY</name>
              <description>[4:4] Bus Busy Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCGC</name>
              <description>[5:5] General Call address received Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCSCLLOW</name>
              <description>[6:6] SCL low</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0BCNT__I2C</name>
          <addressOffset>0x0649</addressOffset>
          <size>8</size>
          <description>USCI B0 Byte Counter Register</description>
          <fields>
            <field>
              <name>UCBCNT0</name>
              <description>[0:0] USCI Byte Counter Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCBCNT1</name>
              <description>[1:1] USCI Byte Counter Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCBCNT2</name>
              <description>[2:2] USCI Byte Counter Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCBCNT3</name>
              <description>[3:3] USCI Byte Counter Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCBCNT4</name>
              <description>[4:4] USCI Byte Counter Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCBCNT5</name>
              <description>[5:5] USCI Byte Counter Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCBCNT6</name>
              <description>[6:6] USCI Byte Counter Bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCBCNT7</name>
              <description>[7:7] USCI Byte Counter Bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0TBCNT</name>
          <addressOffset>0x064A</addressOffset>
          <size>16</size>
          <description>USCI B0 Byte Counter Threshold Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0RXBUF</name>
          <addressOffset>0x064C</addressOffset>
          <size>16</size>
          <description>USCI B0 Receive Buffer</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0TXBUF</name>
          <addressOffset>0x064E</addressOffset>
          <size>16</size>
          <description>USCI B0 Transmit Buffer</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0I2COA0</name>
          <addressOffset>0x0654</addressOffset>
          <size>16</size>
          <description>USCI B0 I2C Own Address 0</description>
          <fields>
            <field>
              <name>UCOA0</name>
              <description>[0:0] I2C Own Address Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCOA1</name>
              <description>[1:1] I2C Own Address Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCOA2</name>
              <description>[2:2] I2C Own Address Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCOA3</name>
              <description>[3:3] I2C Own Address Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCOA4</name>
              <description>[4:4] I2C Own Address Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCOA5</name>
              <description>[5:5] I2C Own Address Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCOA6</name>
              <description>[6:6] I2C Own Address Bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCOA7</name>
              <description>[7:7] I2C Own Address Bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCOA8</name>
              <description>[8:8] I2C Own Address Bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCOA9</name>
              <description>[9:9] I2C Own Address Bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UCOAEN</name>
              <description>[10:10] I2C Own Address enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>UCGCEN</name>
              <description>[15:15] I2C General Call enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0I2COA1</name>
          <addressOffset>0x0656</addressOffset>
          <size>16</size>
          <description>USCI B0 I2C Own Address 1</description>
          <fields>
            <field>
              <name>UCOA0</name>
              <description>[0:0] I2C Own Address Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCOA1</name>
              <description>[1:1] I2C Own Address Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCOA2</name>
              <description>[2:2] I2C Own Address Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCOA3</name>
              <description>[3:3] I2C Own Address Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCOA4</name>
              <description>[4:4] I2C Own Address Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCOA5</name>
              <description>[5:5] I2C Own Address Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCOA6</name>
              <description>[6:6] I2C Own Address Bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCOA7</name>
              <description>[7:7] I2C Own Address Bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCOA8</name>
              <description>[8:8] I2C Own Address Bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCOA9</name>
              <description>[9:9] I2C Own Address Bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UCOAEN</name>
              <description>[10:10] I2C Own Address enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
