MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
        <register>
          <name>UCB0I2COA2</name>
          <addressOffset>0x0658</addressOffset>
          <size>16</size>
          <description>USCI B0 I2C Own Address 2</description>
          <fields>
            <field>
              <name>UCOA0</name>
              <description>[0:0] I2C Own Address Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCOA1</name>
              <description>[1:1] I2C Own Address Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCOA2</name>
              <description>[2:2] I2C Own Address Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCOA3</name>
              <description>[3:3] I2C Own Address Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCOA4</name>
              <description>[4:4] I2C Own Address Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCOA5</name>
              <description>[5:5] I2C Own Address Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCOA6</name>
              <description>[6:6] I2C Own Address Bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCOA7</name>
              <description>[7:7] I2C Own Address Bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCOA8</name>
              <description>[8:8] I2C Own Address Bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCOA9</name>
              <description>[9:9] I2C Own Address Bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UCOAEN</name>
              <description>[10:10] I2C Own Address enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0I2COA3</name>
          <addressOffset>0x065A</addressOffset>
          <size>16</size>
          <description>USCI B0 I2C Own Address 3</description>
          <fields>
            <field>
              <name>UCOA0</name>
              <description>[0:0] I2C Own Address Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCOA1</name>
              <description>[1:1] I2C Own Address Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCOA2</name>
              <description>[2:2] I2C Own Address Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCOA3</name>
              <description>[3:3] I2C Own Address Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCOA4</name>
              <description>[4:4] I2C Own Address Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCOA5</name>
              <description>[5:5] I2C Own Address Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCOA6</name>
              <description>[6:6] I2C Own Address Bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCOA7</name>
              <description>[7:7] I2C Own Address Bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCOA8</name>
              <description>[8:8] I2C Own Address Bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCOA9</name>
              <description>[9:9] I2C Own Address Bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UCOAEN</name>
              <description>[10:10] I2C Own Address enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0ADDRX</name>
          <addressOffset>0x065C</addressOffset>
          <size>16</size>
          <description>USCI B0 Received Address Register</description>
          <fields>
            <field>
              <name>UCADDRX0</name>
              <description>[0:0] I2C Receive Address Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCADDRX1</name>
              <description>[1:1] I2C Receive Address Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCADDRX2</name>
              <description>[2:2] I2C Receive Address Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCADDRX3</name>
              <description>[3:3] I2C Receive Address Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCADDRX4</name>
              <description>[4:4] I2C Receive Address Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCADDRX5</name>
              <description>[5:5] I2C Receive Address Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCADDRX6</name>
              <description>[6:6] I2C Receive Address Bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCADDRX7</name>
              <description>[7:7] I2C Receive Address Bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCADDRX8</name>
              <description>[8:8] I2C Receive Address Bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCADDRX9</name>
              <description>[9:9] I2C Receive Address Bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0ADDMASK</name>
          <addressOffset>0x065E</addressOffset>
          <size>16</size>
          <description>USCI B0 Address Mask Register</description>
          <fields>
            <field>
              <name>UCADDMASK0</name>
              <description>[0:0] I2C Address Mask Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCADDMASK1</name>
              <description>[1:1] I2C Address Mask Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCADDMASK2</name>
              <description>[2:2] I2C Address Mask Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCADDMASK3</name>
              <description>[3:3] I2C Address Mask Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCADDMASK4</name>
              <description>[4:4] I2C Address Mask Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCADDMASK5</name>
              <description>[5:5] I2C Address Mask Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCADDMASK6</name>
              <description>[6:6] I2C Address Mask Bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCADDMASK7</name>
              <description>[7:7] I2C Address Mask Bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCADDMASK8</name>
              <description>[8:8] I2C Address Mask Bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCADDMASK9</name>
              <description>[9:9] I2C Address Mask Bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0I2CSA</name>
          <addressOffset>0x0660</addressOffset>
          <size>16</size>
          <description>USCI B0 I2C Slave Address</description>
          <fields>
            <field>
              <name>UCSA0</name>
              <description>[0:0] I2C Slave Address Bit 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCSA1</name>
              <description>[1:1] I2C Slave Address Bit 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCSA2</name>
              <description>[2:2] I2C Slave Address Bit 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCSA3</name>
              <description>[3:3] I2C Slave Address Bit 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCSA4</name>
              <description>[4:4] I2C Slave Address Bit 4</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCSA5</name>
              <description>[5:5] I2C Slave Address Bit 5</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCSA6</name>
              <description>[6:6] I2C Slave Address Bit 6</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCSA7</name>
              <description>[7:7] I2C Slave Address Bit 7</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCSA8</name>
              <description>[8:8] I2C Slave Address Bit 8</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCSA9</name>
              <description>[9:9] I2C Slave Address Bit 9</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0IE</name>
          <addressOffset>0x066A</addressOffset>
          <size>16</size>
          <description>USCI B0 Interrupt Enable Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0IFG</name>
          <addressOffset>0x066C</addressOffset>
          <size>16</size>
          <description>USCI B0 Interrupt Flags Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UCB0IE__I2C</name>
          <addressOffset>0x066A</addressOffset>
          <size>16</size>
          <description>USCI B0 Interrupt Enable Register</description>
          <fields>
            <field>
              <name>UCRXIE0</name>
              <description>[0:0] I2C Receive Interrupt Enable 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCTXIE0</name>
              <description>[1:1] I2C Transmit Interrupt Enable 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCSTTIE</name>
              <description>[2:2] I2C START Condition interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCSTPIE</name>
              <description>[3:3] I2C STOP Condition interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCALIE</name>
              <description>[4:4] I2C Arbitration Lost interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCNACKIE</name>
              <description>[5:5] I2C NACK Condition interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCBCNTIE</name>
              <description>[6:6] I2C Automatic stop assertion interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCCLTOIE</name>
              <description>[7:7] I2C Clock Low Timeout interrupt enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCRXIE1</name>
              <description>[8:8] I2C Receive Interrupt Enable 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCTXIE1</name>
              <description>[9:9] I2C Transmit Interrupt Enable 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UCRXIE2</name>
              <description>[10:10] I2C Receive Interrupt Enable 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>UCTXIE2</name>
              <description>[11:11] I2C Transmit Interrupt Enable 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>UCRXIE3</name>
              <description>[12:12] I2C Receive Interrupt Enable 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>UCTXIE3</name>
              <description>[13:13] I2C Transmit Interrupt Enable 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>UCBIT9IE</name>
              <description>[14:14] I2C Bit 9 Position Interrupt Enable 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0IFG__I2C</name>
          <addressOffset>0x066C</addressOffset>
          <size>16</size>
          <description>USCI B0 Interrupt Flags Register</description>
          <fields>
            <field>
              <name>UCRXIFG0</name>
              <description>[0:0] I2C Receive Interrupt Flag 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
            <field>
              <name>UCTXIFG0</name>
              <description>[1:1] I2C Transmit Interrupt Flag 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UCSTTIFG</name>
              <description>[2:2] I2C START Condition interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UCSTPIFG</name>
              <description>[3:3] I2C STOP Condition interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>UCALIFG</name>
              <description>[4:4] I2C Arbitration Lost interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>UCNACKIFG</name>
              <description>[5:5] I2C NACK Condition interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>UCBCNTIFG</name>
              <description>[6:6] I2C Byte counter interrupt flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UCCLTOIFG</name>
              <description>[7:7] I2C Clock low Timeout interrupt Flag</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>UCRXIFG1</name>
              <description>[8:8] I2C Receive Interrupt Flag 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UCTXIFG1</name>
              <description>[9:9] I2C Transmit Interrupt Flag 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>UCRXIFG2</name>
              <description>[10:10] I2C Receive Interrupt Flag 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>UCTXIFG2</name>
              <description>[11:11] I2C Transmit Interrupt Flag 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>UCRXIFG3</name>
              <description>[12:12] I2C Receive Interrupt Flag 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>UCTXIFG3</name>
              <description>[13:13] I2C Transmit Interrupt Flag 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>UCBIT9IFG</name>
              <description>[14:14] I2C Bit 9 Possition Interrupt Flag 3</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UCB0IV</name>
          <addressOffset>0x066E</addressOffset>
          <size>16</size>
          <description>USCI B0 Interrupt Vector Register</description>
          <resetValue>0</resetValue>
        </register>
