MarkOstis/qemu-msp/hw/msp430/mcus_db/svd/MSP430FR5739.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Watchdog_Timer</name>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>10</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Watchdog Timer</description>
      <registers>
        <register>
          <name>WDTCTL</name>
          <addressOffset>0x015C</addressOffset>
          <size>16</size>
          <description>Watchdog Timer Control</description>
          <fields>
            <field>
              <name>WDTIS</name>
              <description>[2:0] WDT - Timer Interval Select 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTIS_0</name>
                  <value>0</value>
                  <description>WDT - Timer Interval Select: /2G</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_1</name>
                  <value>1</value>
                  <description>WDT - Timer Interval Select: /128M</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_2</name>
                  <value>2</value>
                  <description>WDT - Timer Interval Select: /8192k</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_3</name>
                  <value>3</value>
                  <description>WDT - Timer Interval Select: /512k</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_4</name>
                  <value>4</value>
                  <description>WDT - Timer Interval Select: /32k</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_5</name>
                  <value>5</value>
                  <description>WDT - Timer Interval Select: /8192</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_6</name>
                  <value>6</value>
                  <description>WDT - Timer Interval Select: /512</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_7</name>
                  <value>7</value>
                  <description>WDT - Timer Interval Select: /64</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTCNTCL</name>
              <description>[3:3] WDT - Timer Clear</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>WDTTMSEL</name>
              <description>[4:4] WDT - Timer Mode Select</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>WDTSSEL</name>
              <description>[6:5] WDT - Timer Clock Source Select 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTSSEL_0</name>
                  <value>0</value>
                  <description>WDT - Timer Clock Source Select: SMCLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_1</name>
                  <value>1</value>
                  <description>WDT - Timer Clock Source Select: ACLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_2</name>
                  <value>2</value>
                  <description>WDT - Timer Clock Source Select: VLO_CLK</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_3</name>
                  <value>3</value>
                  <description>WDT - Timer Clock Source Select: reserved</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTHOLD</name>
              <description>[7:7] WDT - Timer hold</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>